[
  {
    "name": "あげく（に）",
    "意味": "あげく（に）表示经过一段时间的努力或经历后，最终结果是某种不好的、令人遗憾的事。它强调结果往往是负面的，带有一些后悔或无奈的情绪。",
    "tags": [
      "N2",
      "因果",
      "逆接"
    ],
    "接续": "名词词性、动词的普通形/名词+の + あげく（に）",
    "说明": "この文法常用于描述经过某些反复的努力或长时间的行动后，结果却不如预期，通常是负面的结果。要注意，它多用于口语或写作中，且常常带有某种程度的遗憾、后悔的情感。常与表示动作反复或时间长的动词连用。",
    "例句": [
      "彼は毎日遅くまで働いたあげく、健康を壊してしまった。",
      "長い議論をしたあげく、結論が出なかった。",
      "プリンターの調子が悪くなり、製造会社に電話で問い合わせたら、向こうの担当者にあれこれ質問に答えさせられたあげく、対応できないと言われた。",
      "彼女は色々と悩んだあげく、結婚をやめてしまった。"
    ]
  },
  {
    "name": "あまり（に）",
    "意味": "あまり（に）表示由于某种情况的过度或极端，导致了某种意想不到的结果。通常用于描述因某种事物或行为过度而引发的后果。",
    "tags": [
      "N2",
      "因果",
      "程度"
    ],
    "接续": "名词词性、动词/形容词的原形/名词 + あまり（に）",
    "说明": "この文法用于表示因某事过度、极端，以致导致了某种结果，通常是负面或不符合预期的结果。常见的搭配词有‘過ぎる（すぎる）’、‘強調する’等，表示‘过度’的含义。它也可以带有某种程度的意外或惊讶。",
    "例句": [
      "彼はあまりに一生懸命働いたあまり、体調を崩してしまった。",
      "あまりに多くの問題があったあまり、会議は長引いてしまった。",
      "なんでも完全にやろうと思うあまりに、体を壊す人がいる",
      "試験の結果を気にするあまり、夜眠れなくなってしまった"
    ]
  },
  {
    "name": "以上（は）",
    "意味": "表示由于前述的情况或条件成立，理所当然地发生某个结果。可以理解为“既然…就…”",
    "tags": [
      "N2",
      "既然～就"
    ],
    "接续": "名词+以上（は） / 动词/形容词普通形（以上は）",
    "说明": "该文法常用于表达在某种情况下，后续的行为或结果是合乎逻辑的、自然发生的。通常和表示条件的词搭配使用，如“既然…就…”。在口语中也有较为轻松的用法。注意：接续部分的动词或形容词常常是普通形，名词时接“以上（は）”。",
    "例句": [
      "学生である以上、勉強は一番大切だ。",
      "約束した以上、守らなければならない。",
      "もうお酒は飲まないと決めた以上は、どんなに誘われても絶対にそれを守りたい"
    ]
  },
  {
    "name": "上は",
    "意味": "表示前提条件已确定或某种情况已经发生，因此后续的行为或结论是必然的。可以理解为“既然…就…”",
    "tags": [
      "N2",
      "既然～就"
    ],
    "接续": "名词（の）+上は / 动词/形容词普通形+上は",
    "说明": "该文法用于表达在某个前提下，接下来的行为或结果是不可避免或合乎逻辑的。常常带有某种责任感或义务。接续时，名词后需加「の」，并且要注意使用普通形。通常适用于正式或稍有些庄重的场合。与「以上」同、语气更强",
    "例句": [
      "約束した上は、必ず守ります。",
      "親になった上は、子供のために最善を尽くさなければならない。",
      "この問題を解決する上は、時間が必要です。",
      "目標を決めた上は、それに向かって前向きに行動しなければならない"
    ]
  },
  {
    "name": "ようではないか、ようじゃないか",
    "意味": "这是一个用于提议或鼓励对方做某事的表达方式，带有邀请或召唤的意味。",
    "tags": [
      "建议",
      "N2"
    ],
    "接续": "动词的意向形 + ようではないか",
    "说明": "该文法常用于口语中，特别是在非正式场合，用来建议或呼吁某人做某事。它带有一种轻松、友好的语气，也可以用来表达一种呼吁或激励。常见的搭配是表示提议的动词，如「行こう」、「見よう」等。",
    "例句": [
      "一緒に映画を見ようではないか。",
      "みんなで頑張ろうではないか。",
      "この問題を解決しようではないか。",
      "この本に載っているレストランはとても美味しそうだ、みんなで行ってみようじゃないか"
    ]
  },
  {
    "name": "得る/得ない",
    "意味": "表示能够或不能够做某事。'得る'表示可以做到，'得ない'表示不能做到。",
    "tags": [
      "N2",
      "能力"
    ],
    "接续": "动词ます形 + 得る/得ない",
    "说明": "该文法常用于表示某个动作是否有可能或能力完成。'得る'表示可能性，'得ない'表示不可能性。通常用于表达某个行为能否被实现或某个能力是否具备。",
    "例句": [
      "彼はその問題を解決することができ得ない。",
      "この仕事は今すぐに終わらせることが得ない。",
      "このまま海面の上昇が続ければ、これらの島々が海の中に沈んでしまうこともあり得る"
    ]
  },
  {
    "name": "甲斐がある・甲斐がない・甲斐もなく",
    "意味": "表示做某事后有或没有值得的结果或效果，通常带有某种评价。常用来表示某件事情是否值得做。",
    "tags": [
      "N2",
      "其他"
    ],
    "接续": "接续名词，表示某种行为的结果或价值。例如：勉強の甲斐がある（学习有成果）。",
    "说明": "该文法用于表示某个行动或努力是否有意义或效果，常用于表达自己的努力是否得到了回报。搭配使用时通常与动词的词干（如勉強、努力、試み）结合。",
    "例句": [
      "一生懸命勉強した甲斐があって、試験に合格した。",
      "こんなに頑張っているのに、全然甲斐がない。",
      "やってもやっても、甲斐もなく失敗ばかりだ。",
      "三時間待った甲斐があって、雨が止み、美しい景色を見ることができた"
    ]
  },
  {
    "name": "がきっかけで・がきっかけになって・をきっかけにして・をきっかけとして",
    "意味": "表示某个事件、情况或行为是另一个行为或变化的起因或契机，强调前后行动之间的因果关系。",
    "tags": [
      "N2",
      "因果"
    ],
    "接续": "接续名词或动词，表示因某事发生而导致或引起了另一件事。常与名词（事件、出来事等）或动词的过去形接续。",
    "说明": "这个文法用于表示某件事情是另一件事情的起点或契机，强调因某个事件而发生其他变化。常用于描述重要的转折点或契机。",
    "例句": [
      "あの事故がきっかけで、交通ルールを見直すことになった。",
      "彼女との出会いがきっかけになって、音楽に興味を持つようになった。",
      "その映画をきっかけにして、映画製作の勉強を始めた。",
      "その成功をきっかけとして、新しいビジネスを始めた。"
    ]
  },
  {
    "name": "限り",
    "意味": "表示最大限度、尽量竭尽的意思，用于表示在某种条件下能做到的最大程度。",
    "tags": [
      "N2",
      "程度"
    ],
    "接续": "接续名词或动词的基本形，表示在某种条件或范围内，尽最大努力去做某事。例如：できる限り（尽量）、時間が許す限り（只要时间允许）。",
    "说明": "该文法表示尽量做到某事或在某个条件下所能做到的最大限度。通常搭配动词的基本形或名词来使用。在口语中，‘限り’ 也可以与‘ない’（不做）结合，表示不做某事的限制。",
    "例句": [
      "できる限り早く帰ります。",
      "山奥で道に迷い、声のかぎりに助けを求めた",
      "思いつく限りのアイデアは全て出したが、社長は認めてくれなかった"
    ]
  },
  {
    "name": "限り",
    "意味": "表示条件，只要满足某个条件，就会发生某种结果。。",
    "tags": [
      "N2",
      "条件"
    ],
    "接续": "接续动词的基本形或名词（+の）来表示条件。例如：時間がある限り（只要有时间），元気な限り（只要有精力）。",
    "说明": "这个文法用于表示某种条件下，只要满足这个条件，就会有某种结果。常见的搭配是‘限り’后接动词的基本形或名词，表示‘只要’的意思。可以和‘～ない限り’表示‘只要不～就’。",
    "例句": [
      "時間がある限り、私は手伝います。",
      "定年になっても元気な限り、働き続けたいと思っている人が増えている。",
      "彼が帰らない限り、始められません。",
      "生きている限り、嬉しいことも悲しいことも必ずある"
    ]
  },
  {
    "name": "限りでは",
    "意味": "表示根据某种范围或条件所知的情况，通常表示在某个范围内的判断、限制。相当于中文的‘根据～’、‘在～的范围内’。",
    "tags": [
      "N2",
      "范围"
    ],
    "接续": "接续动词的辞书形或名词，表示根据某个范围或条件的情况。通常用于某个领域、经历或知晓的范围内的判断。",
    "说明": "该文法用于表达在某个特定的条件或范围内所做出的推测、判断或结论。常常与‘限りでは’后接的内容有关，比如‘知っている限りでは’（根据我所知道的情况）或者‘今のところ限りでは’（就目前来说）。",
    "例句": [
      "私の知っている限りでは、彼はまだ帰っていません。",
      "今のところ限りでは、この問題は解決していません。",
      "この地域の限りでは、最近はあまり雪が降っていない。",
      "昨日私が調べた限りでは、工場の機械に問題がなかった",
      "私の見る限りでは、彼は信頼できる人物だ",
      "私が聞いた限りでは、双方はまだ合意に達していない"
    ]
  },
  {
    "name": "が契機で・が契機になって・を契機にして・を契機として",
    "意味": "表示某个事件或情况成为其他事情发生的契机、起点或诱因。通常指某个特定事件或行动推动了另一件事情的发展。",
    "tags": [
      "N2",
      "因果"
    ],
    "接续": "1. 名詞＋が契機で / が契機になって\n2. 名詞＋を契機にして / を契機として",
    "说明": "这个文法表达了由于某个事件或情况的发生，促使了另一件事的发生。‘が契機で’和‘が契機になって’强调某事件或情况作为契机，而‘を契機にして’和‘を契機として’更侧重于具体行动或决定。常用于描述一些转折点或重要的契机。注意搭配使用的词汇，通常指的是某种事件或变化。 与きっかけ同、更书面",
    "例句": [
      "転職が契機で、独立して起業しました。",
      "学生時代の経験が契機になって、研究を続けることに決めました。",
      "このイベントを契機に、さらに多くの人々と交流を深めたいと思います。",
      "あの出来事を契機として、企業改革が始まりました。"
    ]
  },
  {
    "name": "かけだ・かける",
    "意味": "表示某个动作正在进行，并且暗示动作的结果可能会有所变化。通常用于描述未完成的动作或某个动作的开始。",
    "tags": [
      "N2",
      "状态"
    ],
    "接续": "动词基本形（未然形）+ かけだ/かける",
    "说明": "这个文法可以用来表达某个动作正在进行时的未完成状态，或者用来指示某个动作的开始，通常带有未完成或不确定的语气。常见于口语中描述某种状态或者某个动作的起始。与‘かける’搭配时，表示正在做某事但还没完成。",
    "例句": [
      "ご飯を食べかけだが、急に出かけなければならなくなった。",
      "本を読みかけて、電話が鳴った。",
      "仕事を始めかけたところで、部長から呼ばれた。",
      "テープルの上に食べかけのケーキが置いてある",
      "テープルの上においた読みかけの本を母が片付けてしまった",
      "家の前で死にかけていた猫を拾って動物病院に連れて行った"
    ]
  },
  {
    "name": "がちだ",
    "意味": "倾向于，往往会（多用于描述消极或不好的倾向）",
    "tags": [
      "N2",
      "其他"
    ],
    "接续": "動詞ます形去ます + がちだ / 名詞 + がちだ",
    "说明": "表示某种倾向，常用于形容容易发生的事情或行为，特别是消极或不好的倾向。多用于描述人的性格或行为，以及某种情况的常态。注意：不用于描述明确的客观事实，而是倾向或习惯性的现象。",
    "例句": [
      "彼は最近仕事を休みがちだ。",
      "冬になると、体調を崩しがちです。",
      "若い頃は、何でも自分で決めがちでした。",
      "先日、病気がちの叔母を見舞いに行った"
    ]
  },
  {
    "name": "かと思えば",
    "意味": "原以为～却（表示与预期相反的结果或意外的转折）",
    "tags": [
      "N2",
      "逆接"
    ],
    "接续": "動詞普通形 + かと思えば",
    "说明": "用于描述某事刚发生时，紧接着却出现了与预期不同的另一件事，或两件事形成对比。常用来表达意外感或惊讶。注意：不用于单纯描述两个连续的事件，而是侧重体现出转折或对比。",
    "例句": [
      "彼は今日は早く来たかと思えば、またすぐ帰ってしまった。",
      "雨が降ったかと思えば、すぐに晴れてきた。",
      "景気が回復したかと思えば、また悪化してきた。"
    ]
  },
  {
    "name": "かと思えば",
    "意味": "既～又～（表示并列，强调两个事物或现象同时存在或交替出现）",
    "tags": [
      "N2",
      "并列"
    ],
    "接续": "動詞普通形 + かと思えば",
    "说明": "用于描述两个不同的现象或事物并列发生，常表达出对事件丰富多样性的观察，而非突出转折或对比。语气上可以带有感叹或惊讶的成分。",
    "例句": [
      "あの人は料理が上手かと思えば、掃除も得意だ。",
      "百歳を超えて生きる人がいるかと思えば、一歳になることもなく、この世を去る赤ん坊もいる",
      "拾った落とし物をわざわざ交番まで届けに行く人がいるかと思えば、人のものを盗む者もいる"
    ]
  },
  {
    "name": "か〜ないかのうちに",
    "意味": "刚刚……就……（表示几乎同时发生的动作）",
    "tags": [
      "N2",
      "其他"
    ],
    "接续": "動詞辞書形 + か + 動詞ない形 + かのうちに",
    "说明": "表示前一动作刚发生或未完成，后一动作几乎同时发生，强调动作间的时间非常短。常用于描述快速连续发生的事件，多为不可控的自然现象或情况。",
    "例句": [
      "チャイムが鳴るか鳴らないかのうちに、学生たちは教室を飛び出した。",
      "先生の講義が終わるか終わらないかのうちに、ノートや教科書を閉じて片付け始める学生もいる",
      "彼が言うか言わないかのうちに、彼女が答えた。"
    ]
  },
  {
    "name": "かねる",
    "意味": "难以，无法，（表示做某事的能力或意愿不足）",
    "tags": [
      "N2",
      "能力"
    ],
    "接续": "動詞ます形 + かねる",
    "说明": "表示由于某种原因，自己无法做某事。常用于表示自己在某种情况下无法进行某种行动，或者由于某些限制无法同意或完成某个请求。此文法具有较为正式的语气，常见于正式场合或书面语中。",
    "例句": [
      "その提案は実行しかねます。",
      "私にはそのようなことはできかねます。",
      "申し訳ありませんが、その件については答えかねます。",
      "面接試験ではどんな質問が出るのかと聞かれたが、そのようなことを聞かれてもちょっと答えかねる",
      "労働条件の変更について会社から説明を受けたが、私はどうも納得しかねる",
      "ご要望には応じかねますので、ご了承ください"
    ]
  },
  {
    "name": "かねない",
    "意味": "有可能，容易（表示某事可能发生，常带有消极的语气）",
    "tags": [
      "N2",
      "能力"
    ],
    "接续": "動詞ます形 + かねない",
    "说明": "表示某种行为或状态可能会导致不好的结果，带有警告或负面的预期。常用于提醒对方某种行为的潜在危险或后果。此文法表达的是一种对未来不确定事件的担忧。",
    "例句": [
      "彼は危険なことをしているので、事故を起こしかねない。",
      "このままだと、試験に落ちかねない。",
      "あまり無理をすると、体を壊しかねない。",
      "適度なスポーツは健康にいいと言われるが、やり過ぎると体を壊しかねない",
      "私は忘れっぽい方なので、こんなところに傘を置いておくと、帰りにまた忘れかねない"
    ]
  },
  {
    "name": "かのようだ",
    "意味": "好像，仿佛（表示与现实情况不符的假设或比喻）",
    "tags": [
      "N2",
      "比喻"
    ],
    "接续": "名詞 + かのようだ / 動詞普通形 + かのようだ / 形容詞普通形 + かのようだ",
    "说明": "表示假设、比喻或推测，常用于描述某种情况看起来像是某种状态，但实际上并非如此。可用于对某种行为、外观、状况的推测或比喻。",
    "例句": [
      "彼はまるで自分が社長かのように振る舞っている。",
      "彼女は忙しいかのように見えるが、実は暇だ。",
      "突然雨が降ってきて、まるで夏が終わったかのようだった。",
      "この人形はとてもよくつかられていて、生きているかのようだ",
      "もう秋になるのに、今日の暑さはまるで真夏に戻ったかのようで、エアコンをつけた家も多かったらしい"
    ]
  },
  {
    "name": "からいいようなものの・からよかったものの",
    "意味": "幸好～～",
    "tags": [
      "N2",
      "其他"
    ],
    "接续": "動詞普通形 + からいいようなものの / 形容詞/形容動詞 + からいいようなものの",
    "说明": "用于表达尽管有某种不如意或缺点，但最终结果还是可以接受，带有一定的忧虑或反思，尤其在存在潜在风险或后果时。常用于口语或稍微正式的场合。",
    "例句": [
      "この大事な資料が見つかったからいいようなものの、万が一、紛失したらどうするんだ。",
      "火事にならなかったからいいようなものの、これからたばこの火の始末に注意してください"
    ]
  },
  {
    "name": "からこそ",
    "意味": "正因为，才（表示强调因果关系，强调前提条件的重要性）",
    "tags": [
      "N2",
      "因果",
      "强调"
    ],
    "接续": "名詞 + からこそ / 動詞辞書形 + からこそ / い形容詞 + からこそ / な形容詞 + だからこそ",
    "说明": "表示某种原因或条件是发生某事的关键，强调因果关系，尤其是在表述正向或强烈的理由时。'からこそ' 重点突出了因果关系中的原因部分，强调前提的特殊性或重要性。",
    "例句": [
      "あなたが頑張ったからこそ、成功したんだ。",
      "こんなに大変だからこそ、やりがいを感じるんだ。",
      "好きなことを職業にする人が多いが、私は映画が好きだからこそ、職業にはしないことにした"
    ]
  },
  {
    "name": "からして",
    "意味": "从某个方面来看，考虑到...（用来强调从某个特定的角度推断或评价）",
    "tags": [
      "N2",
      "从～看"
    ],
    "接续": "名詞 + からして",
    "说明": "用于从某个具体的事物或现象出发，推断或评价其他事物的性质。通常用来表示某一方面的情况足以代表整体或推测。常用来表达强烈的判断或评价。",
    "例句": [
      "彼の話し方からして、彼は本当に仕事に熱心だと思います。",
      "この映画からして、今年の映画は期待できそうだ。",
      "彼女の服装からして、お金持ちだと分かる。",
      "田中さんのプランは、その発想からして、独特だ"
    ]
  },
  {
    "name": "からと言って",
    "意味": "并不因为……就一定，虽然……但是并不意味着……",
    "tags": [
      "N2",
      "逆接",
      "虽然～但是"
    ],
    "接续": "名詞 / 動詞普通形 + からと言って",
    "说明": "用于表示即使前述条件成立，也不意味着一定会发生后述的情况，含有转折的意味。常用于反驳某些人的假设或想法，强调即便有某些条件存在，结果也不一定如预期。",
    "例句": [
      "勉強を頑張ったからと言って、必ずしも成功するとは限らない。",
      "お金があるからと言って、幸せになれるわけではない。",
      "彼は優しいからと言って、何でも許されるわけではない。",
      "しばらく連絡がないからと言って、そんなに心配することないよ",
      "一度ぐらい断られたからと言って、そんなに簡単に諦めないでください"
    ]
  },
  {
    "name": "からには",
    "意味": "既然...就必须...（表示一种强烈的决心或义务）",
    "tags": [
      "N2",
      "既然～就"
    ],
    "接续": "動詞辞書形 + からには / 名詞 + からには",
    "说明": "口语からは、表示因某种条件或原因而产生的强烈决心或责任感，通常含有“既然选择了某种情况，就应该承担相应的责任”的意思。多用于表达做某事是理所当然或不可避免的。",
    "例句": [
      "試験を受けるからには、全力を尽くさなければならない。",
      "社会人になったからには、責任を持って働かなければならない。",
      "彼が行くからには、私も行かないわけにはいかない。",
      "何回も話し合ってみんなで決めたことだ、決めたからには、成功するように頑張ろう"
    ]
  },
  {
    "name": "かわりに",
    "意味": "代替，交换，作为...的替代",
    "tags": [
      "N2",
      "其他"
    ],
    "接续": "名詞 + かわりに / 動詞ます形 + かわりに",
    "说明": "表示某种行为或事物代替了另一种行为或事物。常用于说明在某种情况下，做一件事代替了做另一件事，或是提供某种替代的方式。也可用于表示因某事做出的交换或补偿。注意，前后项需要有较强的替代或交换的关系。",
    "例句": [
      "忙しいので、手紙を書くかわりにメールを送りました。",
      "今日は映画に行くかわりに家でゆっくり休むつもりです。",
      "あなたの代わりにこの仕事をやっておきます。",
      "スーツケースを貸すかわりに、食事をご馳走してもらった"
    ]
  },
  {
    "name": "かわりに",
    "意味": "虽然...但是...（表示对比关系）",
    "tags": [
      "N2",
      "对比",
      "逆接",
      "虽然～但是"
    ],
    "接续": "動詞普通形 / 形容詞普通形 / 名詞 + かわりに",
    "说明": "表示虽然前项是某种情况，但后项有相反或对立的内容。通常用于对比两者之间的不同，或者强调一种对比的转折关系。该用法可用于强调后项带来的意外结果或不同的情况。",
    "例句": [
      "彼は忙しいかわりに、仕事が順調だ。",
      "高いかわりに、このカメラはとても高性能です。",
      "彼女は優しいかわりに、少し真面目すぎるところがある。",
      "この仕事は安定しているかわりに、給料があまり高くない"
    ]
  },
  {
    "name": "気味",
    "意味": "有点儿，稍微（带有消极或不太好的含义，表示某种感觉或状态）",
    "tags": [
      "N2",
      "程度"
    ],
    "接续": "名詞 + 気味 / 動詞ます形去ます + 気味",
    "说明": "用于表示某种感觉或状态，通常带有轻微的否定色彩，指的是不太好或令人不舒服的状态。常常用来描述某个现象或行为的倾向性，带有一定的主观评价。",
    "例句": [
      "今日は少し疲れ気味だ。",
      "最近、彼は食べ過ぎ気味だ。",
      "彼女はいつも不安気味に見える。"
    ]
  },
  {
    "name": "きり",
    "意味": "只有，仅仅，表示限定或限制的意思",
    "tags": [
      "N2",
      "限定"
    ],
    "接续": "名詞 + きり / 動詞た形 + きり",
    "说明": "表示某个范围、数量、时间等的限制或唯一性。常用于表示只有某一事物或某种状态存在，也可以表示某种情况的结束或单一性。注意：与「だけ」相似，但「きり」通常强调的是一种限定的状态。",
    "例句": [
      "彼は一人きりで映画に行った。",
      "この仕事は今日きりで終わりです。",
      "日本に来てから、友達は一人きりです。",
      "一回きりの人生だから、楽しく過ごしたい"
    ]
  },
  {
    "name": "きり",
    "意味": "表示某件事发生之后，后续就没有再发生其他的事情。可以理解为‘发生之后就再也没有’。",
    "tags": [
      "N2",
      "时间",
      "限定"
    ],
    "接续": "名詞 + きり / 動詞た形 + きり",
    "说明": "这个文法通常用于表示某一事件发生后，没有其他事件跟随发生，带有一种结束的意味。常用于回忆过去的事件，强调事后没有继续发生其他事情。",
    "例句": [
      "こんな難しい曲は弾けませんよ、ギターは20年前に習ったきりですから",
      "本田さんとは20年前に一度あったきりだ",
      "彼は引っ越してきたきり、姿を見ていない。",
      "その映画を見たきり、もう二度と見ていない。"
    ]
  },
  {
    "name": "ことから",
    "意味": "根据某种原因或理由，得出某个结论或推测。",
    "tags": [
      "因果",
      "N2"
    ],
    "接续": "动词普通形/名词 + ことから",
    "说明": "常用来表示根据前述的理由或原因推断出后续的结论，语气比较客观。在日常会话或正式场合都可以使用，特别是在表达因果关系时。常常与表达原因的词搭配，如「天気が悪かったことから」等。",
    "例句": [
      "彼が急に辞めたことから、何か問題があったのだろう。",
      "試験の結果が良かったことから、努力が実を結んだと言える。",
      "彼はなんでもよく知っていることから、友達に博士と呼ばれている"
    ]
  },
  {
    "name": "ことだから",
    "意味": "由于某种原因，可以推测或预期某种情况或行为，通常带有某种理解或信任。",
    "tags": [
      "因果",
      "N2"
    ],
    "接续": "名词 + ことだから",
    "说明": "通常用于推测、预测某种行为或状态，语气较为信任或理解，常常用在对某人或某事的推测上。多用于表述与个人经验、特性相关的推测或理由，带有较强的感情色彩。",
    "例句": [
      "彼女は優しいことだから、きっとあなたを助けてくれる。",
      "あの先生のことだから、きっと厳しく指導するだろう。",
      "彼は忙しいことだから、今は電話に出られないだろう。",
      "スポーツならなんでもやる鈴木さんのことだから、きっとスキーも上手でしょう"
    ]
  },
  {
    "name": "ことなく",
    "意味": "不做某事、没有做某事。表示在没有进行某个动作或行为的情况下，某个动作或状态仍然发生或进行。",
    "tags": [
      "N2",
      "否定"
    ],
    "接续": "动词的未然形+ことなく",
    "说明": "该文法多用于书面语或正式场合，常用于表达某个行为没有发生，而其他事情却继续进行。常常搭配表示动作的动词，强调在没有做某事的情况下，另一种事情发生。注意，与‘ないで’的区别在于‘ことなく’多用于表达更正式的语境。",
    "例句": [
      "彼は一言も言うことなく部屋を出て行った。",
      "努力することなく成功することはない。",
      "試験を受けることなく、合格した人がいる。"
    ]
  },
  {
    "name": "ことに",
    "意味": "每当……时、每……之际。表示某种状态或动作的反复发生，通常用于描述季节变化或反复出现的情况。",
    "tags": [
      "N2",
      "时间",
      "每当"
    ],
    "接续": "动词辞书型/名词+ごとに",
    "说明": "该文法用于表达某个事件或现象在特定时间或条件下的重复发生，常用于描写自然现象或周期性的变化。‘ごとに’通常接在表示时间、数量等名词之后，表示‘每……时’。需要注意的是，这种用法偏向描述定期发生的变化，通常不用于具体的动作。",
    "例句": [
      "秋は一雨ごとに涼しくなるという季節だ。",
      "この町では春ごとにお祭りが開かれる。",
      "彼は会うごとに新しい話をしてくる。"
    ]
  },
  {
    "name": "ことにはならない",
    "意味": "不会变成……的情况、不会发生……的结果。表示某种行为或情况并没有发展成预期的结果，强调某个条件或行为不足以达成预期目标。",
    "tags": [
      "N2",
      "否定"
    ],
    "接续": "动词辞书形+ことにはならない",
    "说明": "该文法用于表达某种行为或情况没有达到预期的结果或标准，强调如果没有满足特定的条件，某件事情无法成立或生效。常用于表示某些行为或结果不完整、不充分。",
    "例句": [
      "本やインターネットの資料を写しただけではレポートを書いたことにはならない。",
      "正式な手続きを踏まないと、入社したことにはならない。"
    ]
  },
  {
    "name": "ことは〜が",
    "意味": "虽然……，但是……。用于表达一种对比或转折，前半部分表示肯定或强调某件事，后半部分则转向表达某种对立的情况或限制。",
    "tags": [
      "N2",
      "逆接"
    ],
    "接续": "名词/动词/形容词的名词化+ことは+（动词/形容词/名词）+が",
    "说明": "该文法常用于口语或书面语中，用于表示虽然某个事实成立，但后续有一个相对的限制或矛盾的情况。‘ことは’部分用来强调前面的内容，‘が’部分则引出与之相反或不同的情况。常用于表达一种无奈或妥协的语气。",
    "例句": [
      "彼の言うことは正しいことは正しいが、方法が問題だ。",
      "勉強することはするが、全然やる気がない。",
      "運動は健康に良いことは良いが、やりすぎは良くない。",
      "レポートは最後まで書いたことは書いたんですが、まだ足りない部分もあります"
    ]
  },
  {
    "name": "際には・際は",
    "意味": "当……的时候、在……情况下。用于表示某个特定的时刻或场景，通常是指某个动作或事件发生时的特定条件或时机。",
    "tags": [
      "N2",
      "时间",
      "在"
    ],
    "接续": "名词+際には、名词+際は",
    "说明": "‘際には’用于指特定时刻或条件下的动作、事件等，常用于正式或书面语中，表示某个事件发生的特定时刻或情境。‘際は’用法类似，但更加口语化。两者的使用并无太大区别，都是在特定情况下触发的行为。需要注意，‘際には’常常强调的是一种条件，而‘際は’则更多强调具体的时间或场合。",
    "例句": [
      "旅行の際は、パスポートを忘れずに持って行ってください。",
      "大切なことを話す際は、相手の気持ちを考えるべきだ。",
      "危険な際は、すぐに避難することが重要だ。",
      "お近くにお越しの際には、ぜひ我が家にお寄りください",
      "先月帰省した際に、高校の先生を訪ねた"
    ]
  },
  {
    "name": "ざるを得ない",
    "意味": "不得不、只能。表示因某种情况或原因，不能不做某事，通常用于表示选择余地很小，必须做某事的情形。",
    "tags": [
      "N2",
      "必然"
    ],
    "接续": "动词的未然形+ざるを得ない",
    "说明": "该文法表示由于某种不可避免的原因，必须做某件事情。与‘しなければならない’类似，但‘ざるを得ない’的语气更加强调‘不得不’的无奈感。这个结构在口语中较少使用，偏向正式或书面语。常用在表述无法回避的义务或责任时。",
    "例句": [
      "こんな大きな問題を放置するわけにはいかず、解決せざるを得ない。",
      "台風が近づいているので、明日からの旅行は残念だが、延期せざるを得ない",
      "彼の意見に反対しても、上司の指示に従わざるを得ない。",
      "日本で生活をするのなら、漢字を覚えざるを得ない",
      "２回も同じ間違いをするとは、注意が足りなかったと言わざるを得ない"
    ]
  },
  {
    "name": "次第",
    "意味": "一……就……。表示某个动作或事件发生的先后顺序，通常表示前一个事件完成后，紧接着发生后一个事件。",
    "tags": [
      "N2",
      "顺接"
    ],
    "接续": "动词的ます形/名词+次第",
    "说明": "该文法用于表示因某个条件或情况的发生，另一件事随之发生。常用于较正式的表达场合。‘次第’有时带有一定的正式性或书面语色彩，特别在工作或公告中使用较多。需要注意的是，‘次第’一般用于前后关系密切的事件，而‘次第’用于命令句时，语气会变得比较强。",
    "例句": [
      "会議が終わり次第、連絡します。",
      "天気が良くなり次第、出発しましょう。",
      "私たちが到着次第、イベントを開始します。",
      "検査の結果が分かり次第、ご連絡いたします"
    ]
  },
  {
    "name": "次第だ",
    "意味": "表示原因、理由、原委，常用来解释某种情况或结果的原因，具有解释性、说明性的作用。",
    "tags": [
      "N2",
      "因果"
    ],
    "接续": "名词词性",
    "说明": "‘次第だ’用于说明某事发生的原因或理由，常用于正式场合或书面语中。这个结构在日常对话中使用较少，更多见于正式的解释或陈述。‘次第’在此表示事件发生的顺序或条件，因此‘次第だ’用来强调由于某种情况或事件，导致某种结果。",
    "例句": [
      "遅れたのは電車が遅れた次第だ。",
      "彼が辞めたのは、会社の方針に不満があった次第だ。",
      "先日お伝えした日程に誤りがありましたので、今回、改めてご連絡を差し上げた次第です"
    ]
  },
  {
    "name": "次第だ",
    "意味": "取决于、依赖于。表示某事的结果或情况取决于前提条件或情况，强调后续结果是由前提决定的。",
    "tags": [
      "N2",
      "条件"
    ],
    "接续": "名词+次第だ",
    "说明": "‘次第だ’用于表示某事的结果或行动取决于某个条件或情况。它通常用于表示未来或假设的情境，带有一种依赖或条件性。此用法与‘次第だ’表示原因时的意思有所不同，这里的‘次第’更多强调依赖或决定因素。常见于较正式或书面语的场合。",
    "例句": [
      "天気次第で、ピクニックをするかどうか決めます。",
      "面接の結果次第で、採用が決まります。",
      "出発時間は交通状況次第だ。",
      "この製品はアイデア次第で色々な使い方ができます"
    ]
  },
  {
    "name": "末に",
    "意味": "在……之后、经过……后。表示某个事件或行为发生在一段时间、经过某种过程或结果之后。",
    "tags": [
      "N2",
      "因果"
    ],
    "接续": "名词词性",
    "说明": "‘末に’通常表示经过一段时间、某些过程或反复的行为之后，最终发生的结果。常常用于表示一个较长时间或过程之后的结果，语气上有一定的强调。通常用于较正式或书面语中。",
    "例句": [
      "長い議論の末に、ようやく決定が下された。",
      "何度も考えた末に、この決断を下しました。",
      "数ヶ月のトレーニングの末に、彼は大会で優勝した。",
      "あれこれ悩んだ末に、ABC大学を志望校に決めた"
    ]
  },
  {
    "name": "ずに済む・ないで済む・なくて済む",
    "意味": "不做某事就能解决问题、避免某种情况的发生。表示通过不做某个动作或行为，仍然能够达到预期的结果或避免不好的后果。",
    "tags": [
      "N2",
      "其他"
    ],
    "接续": "动词的未然形+ずに済む/动词的ない形+で済む/动词的连用形+なくて済む",
    "说明": "该文法用于表示通过不做某事，事情能顺利解决或避免麻烦。‘ずに済む’和‘ないで済む’的用法相近，‘ずに’是‘ない’的书面形，‘なくて済む’则多用于口语。一般用于表示理想的、避免麻烦的情况。",
    "例句": [
      "勉強せずに済んだので、今日は遊びに行こう。",
      "幸い友人が冷蔵庫をくれたので、新しいのを買わなくて済んだ",
      "今朝乗っていた電車が一時運転見合わせになったけど、早めに家を出たので、遅刻せずに済んだ。",
      "今回は風邪の症状が軽かったので、病院に行かずに済んだ"
    ]
  },
  {
    "name": "ずにはいられない・ないではいられない",
    "意味": "无法抑制某种情感或行为，表示某种事情不能不做，或强烈的冲动使得某个动作无法停止。",
    "tags": [
      "N2",
      "迫切",
      "必然"
    ],
    "接续": "动词的ない形+ではいられない",
    "说明": "该文法用来表示在某种强烈的情感或冲动驱使下，不能控制自己去做某事。‘ずにはいられない’是稍微正式的表达，而‘ないではいられない’更多用于口语中。两者都强调不能停止或不做某件事。",
    "例句": [
      "彼女は悲しそうな顔を見て、泣かずにはいられなかった。",
      "あの映画は面白すぎて、最後まで見ないではいられなかった。",
      "おいしそうなケーキを見ると、食べずにはいられない。",
      "書類のミスがあまり多かったので、担当者に文句を言わずにはいられなかった。",
      "お世話になった先生が突膳入院されたと聞いて、私は心配で病院に行かずにはいられなかった。"
    ]
  },
  {
    "name": "たいばかりに・欲しいばかりに",
    "意味": "仅仅因为想要做某事或得到某物而做某事。表示由于某种强烈的愿望或欲望，做出了某个行为，强调动机或原因。",
    "tags": [
      "N2",
      "因果",
      "迫切"
    ],
    "接续": "动词的ます形去ます+たいばかりに / 形容词/名词+欲しいばかりに",
    "说明": "该文法用来表示某人因为非常想做某事或非常想得到某物，所以做出某种行动。‘たいばかりに’和‘欲しいばかりに’通常用于表达某种强烈的愿望或欲望驱动下的行为。此用法带有一定的感情色彩，通常表露出说话者的内心动机。",
    "例句": [
      "試験に合格したいばかりに、毎日遅くまで勉強している。",
      "欲しいばかりに、彼女は無理して高価なバッグを買った。",
      "お金が欲しいばかりに、危険な仕事に手を出した。"
    ]
  },
  {
    "name": "だけ・だけあって・だけに・だけのことはある",
    "意味": "表示某种情况、特质或行为正是由于某个原因或条件，通常用于强调预期或实际的结果，表示‘不愧是、到底没白～’。",
    "tags": [
      "N2",
      "因果",
      "强调"
    ],
    "接续": "名词+だけ / 动词的普通形+だけあって / 动词的普通形+だけに / 名词+だけのことはある",
    "说明": "该文法用于强调某个特定的条件、原因或背景，表明某种结果或表现是完全符合预期或合理的，常用于赞美、推崇或认可某人或某事。‘だけあって’用于说明原因与结果的关系；‘だけに’通常用于表示因某种特殊的理由或条件而带来的后果；‘だけのことはある’表示结果或表现是符合该条件的，常用于肯定某人或某事的价值。",
    "例句": [
      "彼は長年の経験だけあって、すぐに問題を解決した。",
      "あのレストランは高級だけに、料理がとてもおいしい。",
      "努力しただけのことはあって、試験に合格した。",
      "あんなに練習しただけのことはある、彼の演技は素晴らしかった。",
      "多くの観光客が訪れるだけあって、確かに山からの景色は素晴らしかった"
    ]
  },
  {
    "name": "だけに",
    "意味": "正因为……，所以更加……。表示由于某个特定的原因或条件，导致某种情况或结果更加明显或更为强烈。",
    "tags": [
      "N2",
      "因果",
      "强调"
    ],
    "接续": "名词+だけに / 动词、形容词的普通形+だけに",
    "说明": "‘だけに’用来强调因某个特定原因或条件而导致的结果，通常表示这种结果因为原因的特殊性或重要性而变得更加突出。常用于表达因某种原因产生的强烈反应或情感，适用于多种情境。",
    "例句": [
      "妹はもともと体が弱いだけに、風邪をひいても心配だ",
      "学生時代に一生懸命勉強しただけに、今は仕事が楽しい。",
      "親の期待が大きかっただけに、ストレスを感じた。"
    ]
  },
  {
    "name": "だけに",
    "意味": "正因为……，反倒……。表示因某种原因或情况，结果却出现了与预期不同的情况，通常带有感叹的语气，强调因果关系。",
    "tags": [
      "N2",
      "因果",
      "逆接"
    ],
    "接续": "动词、形容词、名词+だけに",
    "说明": "该文法表示由于某种原因或背景，结果却产生了相反的效果或出乎意料的情况。‘だけに’用于强调因果关系，并突出了由于某个原因而产生的强烈反应或情感。",
    "例句": [
      "体に自信があるだけに、かえって無理をして体を壊してしまった。",
      "優勝することを期待していただけに、負けた時の失望は大きかった。",
      "あんなに練習しただけに、試合で負けた時はとても悔しかった。"
    ]
  },
  {
    "name": "たところ",
    "意味": "刚刚做了某事，结果发生了某种情况。表示某个动作或行为完成后，出现了预期或出乎意料的结果。",
    "tags": [
      "N2",
      "因果"
    ],
    "接续": "动词的た形+ところ",
    "说明": "‘たところ’用于表达刚做完某个动作后发生的结果，常用于描述直接的经验或感受。它可以用来描述事情的结果，有时带有意外的含义，强调动作之后的状态变化。注意，这个表达偏向口语化，但也常出现在书面语中。",
    "例句": [
      "今朝、駅に着いたところ、電車が出発したばかりだった。",
      "この本を読んだところ、とても面白かった。",
      "店に行ったところ、すでに閉店していた。",
      "会場の問い合わせをしたところ、地図を送ってくれた"
    ]
  },
  {
    "name": "たところが",
    "意味": "刚做完某事，结果却发生了与预期不同的情况。常用于转折，表示预期之外的情况或与期待不符的结果。然而～～",
    "tags": [
      "N2",
      "逆接",
      "因果"
    ],
    "接续": "动词的た形+ところが",
    "说明": "‘たところが’用于表示某个动作完成后，发生了与预期或预想不同的结果，常带有一种转折的意味。这个表达方式常用于描述意外、令人惊讶或与预期相反的情况。通常与‘思ったより’、‘予想外’等词搭配使用。",
    "例句": [
      "駅に着いたところが、電車はもう出発してしまった。",
      "頑張って勉強したところが、試験には合格しなかった。",
      "彼に頼んだところが、返事がなかった。",
      "田中さんならわかるだろうと思って聞いてみたところが、彼にもわからないという"
    ]
  },
  {
    "name": "たところで",
    "意味": "即使做了某事，也无法产生预期的结果。表示做某事之后，结果依然没有改变或无法解决问题。",
    "tags": [
      "N2",
      "逆接",
      "即使～也"
    ],
    "接续": "动词的た形+ところで",
    "说明": "‘たところで’用于表示某个动作或行为做了之后，仍然无法改变结果或无法达成目标。它带有一种否定或无奈的语气，常用于表达某种无效或不切实际的行动。该表达方式常用于负面情境，强调做某事后没有实际效果。",
    "例句": [
      "どんなに謝ったところで、彼は許してくれなかった。",
      "お金を払ったところで、問題は解決しないだろう。",
      "何度頼んだところで、彼は手伝ってくれなかった。",
      "いくら話し合ったところで、この問題を解決することはできません"
    ]
  },
  {
    "name": "たとたんに",
    "意味": "刚……就、一下子就。表示某个动作或事件刚发生时，紧接着又发生了另一个事情，强调两者的时间接续和突然性。",
    "tags": [
      "N2",
      "顺接",
      "时间"
    ],
    "接续": "动词的普通形（过去形）+ たとたんに",
    "说明": "该文法用于表示某个动作或状态刚发生时，紧接着发生了与之相关的另一件事，常用于描述事物的突然变化或令人意外的转折。注意，‘たとたんに’通常用于描述一种瞬间发生的变化，语气上有一种突如其来的感觉。这个结构通常用于口语中，强调两者的时间顺序和紧密联系。",
    "例句": [
      "ドアを開けたとたんに、犬が飛び出してきた。",
      "彼が話し始めたとたんに、みんな静かになった。",
      "ご飯を食べたとたんに、眠くなった。",
      "事務所の鍵を閉めた途端に、中で電話が鳴り始めた",
      "国から来た手紙を見た途端、彼女は泣き出してしまった"
    ]
  },
  {
    "name": "ついでに",
    "意味": "顺便、顺便做某事。表示做某事的同时顺便做另外一件事，通常带有轻松、顺理成章的语气。",
    "tags": [
      "N2",
      "其他"
    ],
    "接续": "动词辞书形/名词+の+ついでに",
    "说明": "该文法用于表达在做某个主要动作的同时，顺便做其他事情。‘ついでに’通常带有轻松、非正式的语气，常常用于日常对话中。它与‘ながら’有相似之处，但‘ついでに’强调顺便做，而‘ながら’强调两个动作同时进行。",
    "例句": [
      "買い物のついでに、郵便局に寄ってきた。",
      "公園に散歩するついでに、ゴミを拾ってきた。",
      "図書館に行くついでに、本を借りてきた。",
      "展覧会に行ったついでに、近くの公園をぶらぶら散歩してきた"
    ]
  },
  {
    "name": "っこない",
    "意味": "绝对不可能……。表示强烈否定某种可能性，带有说话人主观的断定语气。",
    "tags": [
      "N2",
      "否定",
      "能力"
    ],
    "接续": "动词的ます形去掉ます+っこない",
    "说明": "‘っこない’是一种口语表达，通常用于强调对某事绝对不可能发生的强烈否定，带有一定的情感色彩。常用于非正式场合或朋友之间的交流，用来表达说话人的主观判断或断言。",
    "例句": [
      "そんなこと、できっこないよ。",
      "彼が嘘をつきっこない。",
      "こんな重い荷物、一人で持てっこない。"
    ]
  },
  {
    "name": "つつ",
    "意味": "一边……一边……。表示两个动作同时进行。",
    "tags": [
      "N2",
      "并列"
    ],
    "接续": "动词的ます形去掉ます+つつ",
    "说明": "‘つつ’用于表达两个动作同时进行，类似于‘ながら’，但‘つつ’更正式且更常用于书面语。多出现在描述过程中或事件背景中。",
    "例句": [
      "彼は音楽を聞きつつ、宿題をしている。",
      "彼女はその問題について考えつつ、メモを取った。",
      "景色を眺めつつ、友達と話した。"
    ]
  },
  {
    "name": "つつも",
    "意味": "虽然……但是……。表示对立关系或矛盾的心理状态。",
    "tags": [
      "N2",
      "逆接",
      "虽然～但是"
    ],
    "接续": "动词的ます形去掉ます+つつ",
    "说明": "‘つつも’还可以用来表示转折，表达一种矛盾的心理状态，常用于书面语中。一般用于句子中前后主语一致的情况，带有感情色彩。",
    "例句": [
      "早く寝ようと思いつつも、つい夜更かししてしまう。",
      "危険だと知りつつも、彼はその山に登った。",
      "感謝の気持ちを忘れつつも、新しいことに挑戦していきたい。",
      "タバコは体に悪いと知りつつも、つい吸ってしまう"
    ]
  },
  {
    "name": "つつある",
    "意味": "正在……。表示某种动作或状态正在逐步进行或变化。",
    "tags": [
      "N2",
      "状态"
    ],
    "接续": "动词的ます形去掉ます+つつある",
    "说明": "‘つつある’用于描述某个动作或状态正在进行中，通常出现在书面语或正式表达中，强调变化或发展的过程。常与表示渐进、变化的动词连用，例如‘進む’、‘広がる’、‘消え’等。",
    "例句": [
      "地球の温暖化が進みつつある。",
      "新しい技術が次々と生まれつつある。",
      "状況は少しずつ改善されつつある。",
      "環境問題への関心が高くなり、車ではなく電車を利用する人が増えつつある"
    ]
  },
  {
    "name": "っぱなし",
    "意味": "一直保持某种状态。表示某个动作或状态持续进行，通常带有消极或负面的含义，例如疏忽、懒惰等。",
    "tags": [
      "N2",
      "状态"
    ],
    "接续": "动词ます形去掉ます+っぱなし",
    "说明": "该文法用于描述某个状态或动作持续不变，常带有批评或负面的意味。多用于非正式场合，强调某种状态未被处理或结束，例如‘放置不管’的情况。注意，与‘まま’相比，‘っぱなし’的语感更偏向于消极、不好的状态。",
    "例句": [
      "窓を開けっぱなしで出かけた。",
      "テレビをつけっぱなしで寝てしまった。",
      "電気をつけっぱなしにしないでください。",
      "電車が混んでいて、ずっと立ちっぱなしだった。（自动词）"
    ]
  },
  {
    "name": "っぽい",
    "意味": "看起来像某种性质、倾向；带有某种特质或容易产生某种行为。根据上下文可以表示类似、倾向或轻视的含义。",
    "tags": [
      "N2",
      "比喻"
    ],
    "接续": "名词+っぽい / 动词连用形（ます形去掉ます）+っぽい / 形容词连用形（い形去掉い）+っぽい",
    "说明": "‘っぽい’用于表达某人或某物看起来像某种东西，或者表现出某种倾向或特质。也可以带有轻视的语感，尤其是形容‘幼稚’或‘随便’等特性时。常见于口语中，语感相对随意。",
    "例句": [
      "あの子は子供っぽい性格だね。",
      "このシャツは安っぽいけど意外と丈夫だ。",
      "彼は最近、忘れっぽくなってきた。"
    ]
  },
  {
    "name": "てから出ないと・てからなければ",
    "意味": "如果不先做某件事，就无法进行后续动作或发生后续状态。用来表示某种顺序的必要性。",
    "tags": [
      "N2",
      "条件",
      "顺序"
    ],
    "接续": "动词て形+からでないと／からなければ",
    "说明": "该文法用于强调某种前提条件的重要性，通常带有某种否定或消极的语气，表示如果前项不完成，后项就不能发生或难以实现。‘てからでないと’和‘てからなければ’基本可以互换，但‘てからでないと’更偏向书面语和正式表达。",
    "例句": [
      "親の許可をもらってからでないと、この旅行には参加できない。",
      "お金を払ってからでないと、商品は受け取れません。",
      "契約内容を確認してからでなければ、サインはできません。",
      "今日の宿題が終わってから出ないと、遊びに行けない"
    ]
  },
  {
    "name": "てでも",
    "意味": "即使采取极端手段也要……。表示为了达到某个目的，不惜采取某种程度很高的行动。",
    "tags": [
      "N2",
      "程度",
      "即使～也"
    ],
    "接续": "动词的て形+でも",
    "说明": "该文法用来强调即使付出很大的代价或采取极端手段，也要实现某个目标，通常带有强烈的意志或决心。适用于想表达自己坚定的态度或某种必须完成的行为。",
    "例句": [
      "どうしても行きたい。お金を借りてでも行くつもりだ。",
      "彼女に会うためなら、会社を辞めてでも構わない。",
      "その本が必要なら、高いお金を出してでも買うべきだ。",
      "社長という地位を捨ててでも、私にはやりたいことがある"
    ]
  },
  {
    "name": "てまで",
    "意味": "表示动作的程度，指某种行为或状态的极限或过度，通常有夸张的意味。",
    "tags": [
      "N2",
      "程度"
    ],
    "接续": "动词て形 + まで",
    "说明": "常用于表示某种行为或状态做到了极限，或某个动作超出了通常的范围。通常带有一定的夸张或惊讶的语气。和某些词搭配使用时，表示超越正常的或预期的范围。多用于口语中。",
    "例句": [
      "彼は怒って机を叩いてまで、私に怒鳴った。",
      "そんなことをしてまで、お金を手に入れようとするなんて信じられない。",
      "彼女は泣いてまで、私に謝ってきた。",
      "借金してまで遊びに行ったと聞いて、呆れてしまった",
      "最近の祭りは以前ほど活気がなくなってきた、仕事を休んでまで行く必要はないだろう"
    ]
  },
  {
    "name": "ではあるまいか",
    "意味": "表示一种推测或判断，类似于‘不是……吗’或‘应该是……吧’的意思，常用于较正式或书面语的场合。",
    "tags": [
      "N2",
      "其他"
    ],
    "接续": "名词/な形容词 + ではあるまいか",
    "说明": "该表达用于提出一种较为谨慎或委婉的推测，适合在正式的文章、演讲等场合使用。语气较为郑重，语感比‘ではないだろうか’更强烈。适用于描述主观判断但不确定的情况。",
    "例句": [
      "この計画は成功するのではあるまいか。",
      "彼は何か秘密を隠しているのではあるまいか。",
      "このままでは問題が大きくなるのではあるまいか。"
    ]
  },
  {
    "name": "てはいられない",
    "意味": "不能做某事，表示由于某种原因，不能继续做某个动作或保持某种状态，常带有强烈的否定感。",
    "tags": [
      "N2",
      "否定",
      "能力"
    ],
    "接续": "动词的て形+はいられない",
    "说明": "这个表达通常用于表示某种情感或理由使得某人不能继续进行某个行为。它常常带有紧迫感、无法容忍的语气。常用于口语中，尤其是在表达某人因无法忍受或某些情况限制而无法行动时。",
    "例句": [
      "こんなひどいことをしてはいられない。",
      "勉強しないで遊んではいられない。",
      "こんなに遅れてはいられない、急いで行かなければ。",
      "事の真相を知った以上、もう黙ってはいられない",
      "仕事が予定より遅れている、だから、今度の日曜日は、仕事を休んではいられない"
    ]
  },
  {
    "name": "てばかりはいられない・てばかりもいられない",
    "意味": "表示不能只做某一件事，强调不能专注于某一方面而忽略其他事情。通常用来表达不能一味地做某事，应该兼顾其他的事情。",
    "tags": [
      "N2",
      "能力",
      "否定"
    ],
    "接续": "动词て形 + ばかりはいられない/ばかりもいられない",
    "说明": "这个文法通常用于提醒自己或他人不能一直做一件事，应该有其他的行动或者责任。常见搭配有：勉強ばかり、仕事ばかり、遊びばかり等。",
    "例句": [
      "遊んでばかりはいられない。勉強もしなければならない。",
      "仕事ばかりもいられない。休む時間も大切だ。",
      "いつも食べてばかりはいられない。運動もしなければならない。",
      "体の調子が悪いからと言って、このまま会社を休んでばかりはいられない"
    ]
  },
  {
    "name": "てはじめて",
    "意味": "表示某个动作或状态在某个条件下才会发生，强调这是第一次或在某个条件下才能实现的情况。",
    "tags": [
      "N2",
      "顺接",
      "条件"
    ],
    "接续": "动词て形 + はじめて",
    "说明": "这个文法通常用于表达某个动作发生后才会有进一步的结果，常用于描述第一次体验某事或某种结果的出现。可以与‘初めて’一同使用，强调是第一次做某事。",
    "例句": [
      "日本に来てはじめて、温泉に行きました。",
      "この仕事をしてはじめて、チームワークの大切さが分かりました。",
      "運転免許を取ってはじめて、自分で車を運転できるようになった。",
      "外国で生活をして初めて、自分の国の良さがわかった"
    ]
  },
  {
    "name": "ではすまされない",
    "意味": "表示某种行为、问题或情况不能被轻易解决或被接受，通常用来表达事情的严重性或无法通过简单的方式解决。",
    "tags": [
      "N2",
      "否定"
    ],
    "接続": "接续在名词、动词基本形、形容词等后面。常见的形式有：名词+では済まされない、动词基本形+では済まされない。",
    "说明": "该文法多用于强调不能仅仅通过某种简单的方式应对问题或情况，通常带有负面的含义。常在对某事的讨论中，用来表达不满足于现状或对事态的严重警告。",
    "例句": [
      "あんな簡単なことで済まされないよ。",
      "この問題は注意深く対応しないとでは済まされない。",
      "その失敗では済まされないと彼は怒っていた。",
      "課長である以上、そんな大事なことを知らなかったでは済まされないだろう",
      "この物語はただの笑い話では済まされないと思うところがある"
    ]
  },
  {
    "name": "ということだ",
    "意味": "表示听说、传闻或根据别人说法得知的意思。常用于口语中，表达某件事情是根据外界的说法或消息传出来的。",
    "tags": [
      "N2",
      "依据"
    ],
    "接続": "动词（普通形）＋ということだ\n名词＋ということだ",
    "说明": "这个文法用于表达通过他人或媒体听到的信息。通常情况下，它用来传达某种未经自己亲身确认的消息或情况。这个表达形式比较口语化，常常用于日常对话中。",
    "例句": [
      "彼は来週転職するということだ。 (听说他下周要跳槽。)",
      "その店は閉店するということだ。 (听说那家店要关门了。)",
      "彼女が結婚するということだ。 (我听说她要结婚了。)"
    ]
  },
  {
    "name": "ということだ",
    "意味": "表示推测、总结或解释的意思，相当于中文的“也就是说”。常用于说明原因、推测或总结前述内容。",
    "tags": [
      "N2",
      "解释"
    ],
    "接続": "动词（普通形）＋ということだ\n名词＋ということだ\n形容词（普通形）＋ということだ",
    "说明": "这个文法常用于口语中，表示对某一情况或信息的总结或进一步解释。它常常用于与前文的内容相关联，做出一个解释或者推断。需要注意的是，这个文法在口语中使用频繁，在书面语中较少见。",
    "例句": [
      "彼は明日来るということだ。 (他明天会来，也就是说。)",
      "試験に合格したということだ。 (他通过了考试，也就是说。)",
      "天気予報によると、明日は雨が降るということだ。 (根据天气预报，明天将下雨，也就是说。)",
      "こんな時間になっても森さんは姿を現さない、今日も遅刻ということだね"
    ]
  },
  {
    "name": "というものだ",
    "意味": "用于解释、说明某种事物的本质或定义，或者表达理所当然的情况。常用于给出某种观点、判断或评价。",
    "tags": [
      "N2",
      "解释"
    ],
    "接续": "名词/动词普通形 + というものだ",
    "说明": "该文法常用于解释某事物的本质或性质，也可以用来表达理所当然的行为或事情。通常用于正式或书面语中，有时也用于某种情感的表达。",
    "例句": [
      "この仕事は経験を積むことが大切だというものだ。",
      "成功するためには努力が必要だというものだ。",
      "日本の文化というものは、礼儀を重んじることだ。",
      "この新しい電池は、光と熱のエネルギーを利用しようというものだ",
      "相手の話も聞かずに自分の主張だけ通そうとするなんで、それはわがままというものだ"
    ]
  },
  {
    "name": "というものではない",
    "意味": "某种事物或情况并不是按照所说的那样，表示否定或否认某种常见的理解或假设。",
    "tags": [
      "N2",
      "否定"
    ],
    "接续": "名词 + というものではない / 动词基本形 + というものではない",
    "说明": "用于否定某种常见的看法、概念或想法，通常用于表达对某件事物的不同看法或立场。常用于说明并非所有情况下都成立，或对某个概念进行否定。",
    "例句": [
      "成功するためには運が必要だというものではない。",
      "お金をたくさん持っているから幸せだというものではない。",
      "勉強すれば必ず成功するというものではない。",
      "勝負は勝てば良いというものではない、どんな勝ち方をしたのかが重要である"
    ]
  },
  {
    "name": "というより",
    "意味": "比起...，更像是...，与其说。。。不如说。。表示更合适的说法或更贴切的表达。",
    "tags": [
      "N2",
      "对比"
    ],
    "接续": "名词 + というより / 动词普通形 + というより / 形容词 + というより",
    "说明": "用来表示与其说某事是A，不如说它是B，通常用于表达一种更恰当或更合适的判断，强调后者的特点。常用于纠正或修正前面的说法。",
    "例句": [
      "彼は先生というより友達のようだ。",
      "この料理は美味しいというより、驚くほどおいしい。",
      "彼の行動は反抗的というより、無関心だった。",
      "駅から家までバスに乗らずに歩くのは、節約というより健康のためだ"
    ]
  },
  {
    "name": "と言っても過言ではない",
    "意味": "虽然可能听起来夸张，但并不是过分的说法，表示某事在一定程度上是成立的，虽然表面上看起来可能过于夸张或极端。",
    "tags": [
      "N2",
      "程度",
      "即使～也"
    ],
    "接续": "动词普通形 + と言っても過言ではない / 形容词 + と言っても過言ではない / 名词 + と言っても過言ではない",
    "说明": "用于表达对某个说法的强烈肯定，意味着即使看起来有些夸张，实际情况是符合的，通常用于强调事物的重要性或性质。",
    "例句": [
      "彼の功績は歴史に残ると言っても過言ではない。",
      "この映画は人生を変えるほど感動的だったと言っても過言ではない。",
      "この計画が成功すれば、未来の技術革新と言っても過言ではない。"
    ]
  },
  {
    "name": "かと思うと・かと思ったら",
    "意味": "刚...就...，表示某事发生得非常迅速，通常用来描述时间上紧接着发生的动作或变化。",
    "tags": [
      "N2",
      "时间"
    ],
    "接续": "动词普通形 + かと思うと / かと思ったら",
    "说明": "这个文法用来表达某个动作发生之后，紧接着发生了另一件事，通常带有一种意外的感觉或描述非常迅速发生的事件。可以用于描述情境变化的突然性或不可预测性。",
    "例句": [
      "仕事が終わったかと思うと、また次の仕事が始まった。",
      "息子は朝学校に行く際に、必ずといっていいほど忘れ物をしている、出かけたかと思うと、すぐ忘れ物を取りに帰ってくる"
    ]
  },
  {
    "name": "かと思うと・かと思ったら",
    "意味": "原以为...，结果却...，表示对某个情况的预期和实际结果的差异。",
    "tags": [
      "N2",
      "对比",
      "逆接"
    ],
    "接续": "动词普通形 + かと思うと / かと思ったら",
    "说明": "用来表示某人原本以为某事会发生某种情况，但实际上发生了与预期不同的结果。通常用来强调意外的转折或出乎意料的情况。",
    "例句": [
      "彼はすぐに帰るかと思うと、結局一日中外にいた。",
      "試験が簡単だと思ったかと思うと、問題が難しくて驚いた。",
      "今日は晴れるかと思ったら、急に雨が降り出した。",
      "妹は今勉強を始めたかと思ったら、もう今でテレビを見ている"
    ]
  },
  {
    "name": "どころか",
    "意味": "不仅仅是...，反而...，用于强调与预期或一般情况相反的情况，表示比某事更极端的情况。",
    "tags": [
      "N2",
      "对比",
      "逆接",
      "ところ"
    ],
    "接续": "名词 + どころか / 动词普通形 + どころか / 形容词 + どころか",
    "说明": "用于表示某事并非像预期那样，而是更为极端或更加严重，通常带有一种意外或否定的语气。常用于反驳某个观点或对比不同情况。",
    "例句": [
      "お金が足りないどころか、借金がある。",
      "野党の追及に対し、大臣は満足な回答ができなかったどころか、質問の内容すら理解できていなかった",
      "忙しくて食事どころか、水も飲む時間がなかった。"
    ]
  },
  {
    "name": "ところだった",
    "意味": "差点...，表示某个动作或事件差点发生，常带有未遂或避免某种结果的含义。",
    "tags": [
      "N2",
      "程度",
      "ところ"
    ],
    "接续": "动词普通形 + ところだった / 形容词 + ところだった / 名词 + の + ところだった",
    "说明": "用于表达差点发生某事，或者某种情况差一点就发生了。常用来回忆或反思过去的情境，表示接近发生不好的结果，强调未遂的状态。",
    "例句": [
      "車にひかれるところだった。",
      "遅刻するところだったが、ギリギリ間に合った。",
      "あの時、彼に謝るところだったけど、言い出せなかった。",
      "ちゃんと前を見て運転してよ、今、隣の車にぶつかるところだったよ"
    ]
  },
  {
    "name": "どころではない",
    "意味": "根本不可能，表示某种情况或状态远远超出能够做某事的程度，强调完全无法进行某个动作或状态。",
    "tags": [
      "N2",
      "否定",
      "程度",
      "ところ"
    ],
    "接续": "名词 + どころではない / 动词辞书形 + どころではない / 形容词 + どころではない",
    "说明": "用于表达由于某种原因，某件事情完全不可能进行或发生，通常表示情况非常严重、紧急或不可行，强调与预期的状态有很大差距。常用于描述无法处理某事或无法从事某事。",
    "例句": [
      "今は勉強どころではない、試験の準備ができていない。",
      "そんなお金がないどころではない、借金があるんだ。",
      "彼は遊びに行くどころではない、仕事に追われている。"
    ]
  },
  {
    "name": "ところに・ところへ・ところを",
    "意味": "正当～～时候，表示某个动作或事件发生的地点、时机或场合。",
    "tags": [
      "N2",
      "在",
      "ところ"
    ],
    "接续": "名词词性",
    "说明": "用于表示某个动作、事件或情况发生的地点或时机。'ところに' 常用来指某个具体的地方或时刻，'ところへ' 侧重表示动作或状态的方向或目标。常用于表示某人到某个地方后发生的事情。",
    "例句": [
      "ちょうど電話をかけようと思ったところに、彼から電話がかかってきた。",
      "彼女が出かけようとしたところへ、突然雨が降り出した。",
      "図書館へ行くところに、友達に会った。",
      "授業中漫画を読んでいるところを先生に見つかった"
    ]
  },
  {
    "name": "ところを見ると",
    "意味": "从...的情况来看，表示根据某种情况、事实或迹象推测或判断某事。",
    "tags": [
      "N2",
      "因果",
      "从～看",
      "ところ"
    ],
    "接续": "动词普通形 + ところを見ると / 名词 + ところを見ると / 形容词 + ところを見ると",
    "说明": "用于根据观察到的情况或信息做出推测或判断。常用于描述某个具体的现象或情况之后，推测出某种可能性或结论。注意，它常常出现在描述已经发生的事情之后。",
    "例句": [
      "彼の様子を見ると、何か困っているようだ。",
      "天気予報を見ると、明日は雨が降るらしい。",
      "この仕事を見ているところを見ると、彼は非常に真面目な人だと思う。",
      "朝からニコニコしているところを見ると、何かいいことがあったに違いない",
      "彼があんなに喜んでいるところを見ると、彼の成績はかなり上がったに違いない"
    ]
  },
  {
    "name": "としか言いようがない",
    "意味": "只能说...，表示没有其他合适的表达方式，或者说没有其他可能性，通常用来表达无法用其他方式说明的情感、情形或看法。",
    "tags": [
      "N2",
      "限定"
    ],
    "接续": "动词普通形 + としか言いようがない / 形容词 + としか言いようがない / 名词 + としか言いようがない",
    "说明": "しか〜ない用于表示在某种情况下没有其他选择或表达方式，强调所说的内容是唯一可以理解或接受的。常用于表达一种无奈、不可避免的情感或判断。",
    "例句": [
      "あの映画はひどかったとしか言いようがない。",
      "彼の行動は理解できないとしか言いようがない。",
      "これが最善の結果だとしか言いようがない。",
      "あんなに巨大な建物を大昔の人が作ったとは、不思議としか言いようがない",
      "この病気が治ったことは奇跡としか言いようがない"
    ]
  },
  {
    "name": "としたら・とすれば",
    "意味": "假设，如果...的话，用于假设某种情况或前提，并推测后果或做出相应的判断。",
    "tags": [
      "N2",
      "如果"
    ],
    "接续": "名词 + としたら / 动词普通形 + としたら / 形容词 + としたら / 名词 + とすれば / 动词普通形 + とすれば",
    "说明": "用于假设某种情况成立时，推测或讨论可能的结果。'としたら' 和 'とすれば' 的用法非常相似，'とすれば' 通常用于更正式的场合。两者都表示如果某事成为事实或某个条件成立时的推测。",
    "例句": [
      "もし明日雨が降るとしたら、ピクニックは中止になるだろう。",
      "彼が来るとすれば、早く到着するはずだ。",
      "この問題を解決できるとしたら、誰かの助けが必要だ。"
    ]
  },
  {
    "name": "とともに",
    "意味": "和...一起，同时，随着，表示伴随或并列的关系。",
    "tags": [
      "N2",
      "并列",
      "伴随"
    ],
    "接续": "名词 + とともに / 动词辞书形 + とともに",
    "说明": "这个文法用来表示与某事物一起发生，通常用于并列关系或伴随变化。也可以用于表示随着时间的推移，某个状态或变化的发生。",
    "例句": [
      "私たちは共に働くとともに、成長していきます。",
      "景気の回復とともに、企業の利益も増加した。",
      "技術の進歩とともに、生活はどんどん便利になった。",
      "自動車の普及とともに、交通渋滞の問題もけんざい化してきた"
    ]
  },
  {
    "name": "とは限らない",
    "意味": "不一定，未必，表示并非所有情况都符合某个规律或假设，具有否定的含义。",
    "tags": [
      "N2",
      "否定"
    ],
    "接续": "名词 + とは限らない / 动词普通形 + とは限らない",
    "说明": "这个表达用于说明某个现象或结论并非总是成立，通常用于表达不确定或否定某种普遍的假设或期望。常常与普遍的或一般的情况相对。",
    "例句": [
      "お金があれば幸せになるとは限らない。",
      "勉強すれば必ず成功するとは限らない。",
      "見た目がよいからと言って、性格がいいとは限らない。",
      "実力のあるチームだからといって、必ず勝つとは限らない"
    ]
  },
  {
    "name": "ない限り",
    "意味": "除非...，表示条件或限制，只有在某种情况或条件下，才能发生某事。",
    "tags": [
      "N2",
      "条件",
      "必然"
    ],
    "接续": "动词ない形 + 限り / 形容词ない形 + 限り / 名词 + 限り",
    "说明": "用于表达某种条件下，某个行为或事件才会发生。通常是对条件的否定，表示除非某个条件满足，否则不会发生某件事。常用来表示限制性的条件。",
    "例句": [
      "雨が降らない限り、ピクニックに行く予定だ。",
      "彼が戻らない限り、仕事を始めることはできません。",
      "健康でない限り、長生きできないと言われています。",
      "資金の問題を解決しない限り、この工事を続けられない",
      "この地方は人口がだんだん減っていて、何か対策を立てない限り、今後も増えることはないだろう"
    ]
  },
  {
    "name": "ないことには",
    "意味": "如果不...，就无法...，表示某种条件没有满足时，后续的事情无法进行。",
    "tags": [
      "N2",
      "条件"
    ],
    "接续": "动词ない形 + ことには",
    "说明": "用于表示某件事或条件没有实现时，后面的事情无法发生或完成。常常用来表达前提条件或阻碍因素。",
    "例句": [
      "準備が整わないことには、会議を始めることはできません。",
      "彼が謝らないことには、問題は解決しないでしょう。",
      "あなたの許可がないことには、何も進められません。",
      "事実を確認しないことには、なんとも申し上げられません",
      "一度行ってみないことには、どんなところかわからないだろう"
    ]
  },
  {
    "name": "ないことはない・ないこともない",
    "意味": "并不是不可能，表示某事虽然可能性较低，但并非完全不可能。",
    "tags": [
      "N2",
      "能力"
    ],
    "接续": "动词ない形 + ことはない",
    "说明": "这个表达用于表示某事虽然不常见或不容易实现，但从理论上讲是可能的。通常带有一种不太肯定但又没有完全否定的语气。",
    "例句": [
      "この仕事は難しいけど、できないことはない。",
      "彼女がそんなことをすることはないことはないけど、可能性は低い。",
      "今からでも間に合わないことはないけど、急がなければならない。",
      "私も留学していたことがありますから、あなたの苦労がわからないこともありません"
    ]
  },
  {
    "name": "ないではない・ないでもない",
    "意味": "不是说不...，也可以...，表示在某种情况下，虽然表面上否定，但实际上有某种可能性或并非完全否定。",
    "tags": [
      "N2",
      "能力"
    ],
    "接续": "动词ない形 + ではない / ないでもない / 形容词ない形 + ではない / ないでもない",
    "说明": "这两个表达都用于表示某种事物或情况并非完全否定，具有某种模糊性或可能性。'ないではない' 和 'ないでもない' 都是柔和的否定，通常表示可以在某种程度上接受或发生某事。",
    "例句": [
      "あの映画は面白くないではないが、少し退屈だった。",
      "行かないでもないが、忙しくて時間がない。",
      "彼の提案は悪くないでもないが、まだ検討の余地がある。"
    ]
  },
  {
    "name": "なくはない・なくもない",
    "意味": "并不是不...，表示某种情况或动作并非完全否定，有一定的可能性或接受的余地。",
    "tags": [
      "N2",
      "否定"
    ],
    "接续": "动词ない形 + なくはない / なくもない",
    "说明": "这两个表达都表示某种否定的说法并非绝对，意思是某件事情虽然否定了，但依然有可能发生或被接受。'なくはない' 和 'なくもない' 都是柔和的否定，用来表示某种条件下是可以接受的。",
    "例句": [
      "行かなくはないが、少し疲れている。",
      "彼女は嫌いではないが、あまり会いたくない。",
      "その案は悪くなくはないが、もっと改善できると思う。"
    ]
  },
  {
    "name": "ながら",
    "意味": "虽然...但是...，表示前后动作同时发生，或前后对比，用于表达尽管一方存在，但另一方依然发生。",
    "tags": [
      "N2",
      "逆接",
      "虽然～但是"
    ],
    "接续": "动词ます形 + ながら / 形容词 + ながら / 名词 + ながら",
    "说明": "这个文法表示两个动作或状态同时发生，常用于表达前后对比或让步，表示虽然前面提到的情况存在，但后面的情况依然发生，通常强调后者。虽然可以用在描述两个同时进行的动作，但在表示“虽然...但是...”时，用法类似于让步句式。",
    "例句": [
      "彼は若いながら、すごく優れた技術を持っている。",
      "忙しいながら、仕事を終わらせた。",
      "この料理は簡単ながら、とても美味しい。",
      "あの経営者は、不良品と知りながら、製品を販売していた"
    ]
  },
  {
    "name": "にあたって・にあたり",
    "意味": "在...时，表示在某个特定的时刻、场合或事件发生之前或期间，需要做某件事。",
    "tags": [
      "N2",
      "在"
    ],
    "接续": "名词 + にあたって / 名词 + にあたり",
    "说明": "这个表达常用于强调在某个重要的时刻、场合或行动开始之前，做出某些准备或采取某些措施。通常用于正式场合或表达需要特别关注的情况。",
    "例句": [
      "新しいプロジェクトを始めるにあたって、十分な準備が必要です。",
      "結婚式を挙げるにあたり、色々と計画を立てました。",
      "就職活動を始めるにあたり、履歴書を更新しました。",
      "新年を迎えるに当たって、一年の計画を立てた"
    ]
  },
  {
    "name": "に応じて",
    "意味": "根据...，按照...，表示根据某种情况、条件、需要或要求采取行动或做出反应。",
    "tags": [
      "N2",
      "依据"
    ],
    "接续": "名词 + に応じて / 动词普通形 + に応じて",
    "说明": "用来表示根据特定的条件、要求或情况采取相应的措施或做出反应。这个表达方式通常用于描述根据不同情境进行调整或改变。",
    "例句": [
      "お客様のニーズに応じて、サービスを提供します。",
      "年齢に応じて、料金が異なります。",
      "この商品は使い方に応じて、様々な機能を持っています。",
      "このレストランは、客の予算に応じていくつかのコースを用意してくれる",
      "旅行のプランは、お客様のご希望に応じて変更できます"
    ]
  },
  {
    "name": "にかかわらず・にかかわりなく",
    "意味": "无论...，表示不受某种条件、情况或限制的影响，强调对某个动作或结果的普遍适用性。",
    "tags": [
      "N2",
      "不管不论"
    ],
    "接续": "名词 + にかかわらず / 动词/形容词 + にかかわらず / 名词 + にかかわりなく",
    "说明": "这两个表达用于表示某种情况或条件不影响后续的动作或结果，强调不管前面的条件如何，后续的事情依然成立或继续。'にかかわらず' 和 'にかかわりなく' 在用法上是相同的，通常用于表示不受限制或不受影响。",
    "例句": [
      "天気にかかわらず、明日は旅行に行きます。",
      "年齢にかかわらず、誰でもこのイベントに参加できます。",
      "彼の意見にかかわりなく、決定はそのまま進められる。",
      "好きか嫌いかにかかわらず、この仕事は必ずしなければならない"
    ]
  },
  {
    "name": "に関わる",
    "意味": "与...有关，涉及...，表示某事物或某人对某个事物有关系或影响。",
    "tags": [
      "N2",
      "其他"
    ],
    "接续": "名词 + に関わる",
    "说明": "用于表示某事物与另一个事物有关系、涉及，或某人参与某种事务。常用于描述与某个领域或主题相关的事物，常带有一定的影响力或重要性。",
    "例句": [
      "この問題は私の仕事に関わることなので、慎重に考えなければならない。",
      "環境問題に関わる法律が改正された。",
      "彼はそのプロジェクトに関わる重要な役割を担っている。",
      "市役所では市民の生活に関わる様々な相談に応じている"
    ]
  },
  {
    "name": "に限り・に限って",
    "意味": "仅限于...，只有...，表示某事物或某条件的限定，通常用于强调某种特定的范围或情况。",
    "tags": [
      "N2",
      "限定"
    ],
    "接续": "名词 + に限り / 名词 + に限って",
    "说明": "这两个表达都用于限定某个范围或特定条件，强调某种特定的情况或群体。'に限り' 强调范围的限定，通常用于表明某种条件或时间的限制；而 'に限って' 强调某种特殊情况或例外，常用于反常或特例的情况。",
    "例句": [
      "この割引は会員に限り適用されます。",
      "今日に限り、営業時間が延長されます。",
      "あなたに限って、そんなことはしないだろう。",
      "お葉書をお送りくださった皆様の中から百名様に限り、素敵な商品をプレゼントいたします"
    ]
  },
  {
    "name": "に限って",
    "意味": "唯独...，表示某个特定的人、时间或事物的特殊情况或例外，通常带有强调排他性的意味。",
    "tags": [
      "N2",
      "限定"
    ],
    "接续": "名词 + に限って",
    "说明": "用于表示某个特定情况的排他性或例外性，强调只有在某种特殊情况下发生某件事。通常带有一种强烈的感情色彩，表示某个群体或个体与其他的不同。",
    "例句": [
      "時々家の中がものすごく散らかってしまうことがある、そんな時に限って、突然客が訪ねてきたりする",
      "大切な用事があって遅刻しては行けない時に限って、寝坊してしまった",
      "予習していない時に限って、先生に当てられった"
    ]
  },
  {
    "name": "に限る",
    "意味": "最好的，最适合的，表示某种选择或情况是最理想或最合适的。",
    "tags": [
      "N2",
      "建议"
    ],
    "接续": "名词 + に限る / 动词辞书形 + に限る",
    "说明": "のが1番いい、用于表示某种方式或做法是最理想、最合适的，通常是对某个情况或选择的推荐。常用于给出建议或表达某种偏好，表示在各种选项中最推荐的选择。",
    "例句": [
      "暑い日は冷たい飲み物に限る。",
      "旅行にはやはり飛行機に限る。",
      "勉強するなら、静かな場所に限る。",
      "疲れた時は、寝るに限ります"
    ]
  },
  {
    "name": "に限らず",
    "意味": "不仅仅是...，不仅限于...，表示某事物或情况不仅包括某个范围，还包括其他相关的事物或情况。",
    "tags": [
      "N2",
      "顺接",
      "不仅"
    ],
    "接续": "名词 + に限らず",
    "说明": "用于表示某个事物或情况不仅限于特定的范围或条件，而是包含更多的事物或情况。常用于扩展某个概念或说明事物的广泛性。",
    "例句": [
      "この問題は学生に限らず、先生にも関係があります。",
      "彼は日本に限らず、世界中を旅している。",
      "あの店は食べ物に限らず、いろいろな商品を売っている。",
      "あの選手は子供の頃、サッカーに限らず、スポーツならなんでも得意だったそうだ"
    ]
  },
  {
    "name": "にかけては",
    "意味": "在...方面，表示某人在某个领域或方面的能力、特长或经验。",
    "tags": [
      "N2",
      "在"
    ],
    "接续": "名词 + にかけては",
    "说明": "用于强调某人在某个特定领域或方面的能力、特长或经验，通常用来表示对某个方面的擅长或专长，表示自信或在该领域的优势。",
    "例句": [
      "彼は料理にかけては右に出る者がいない。",
      "そのプロジェクトにかけては、彼が一番信頼できる。",
      "私たちのチームは分析にかけては、業界で最高だと思っています。",
      "値段は別として、味の良さにかけては、このレストランが1番だ",
      "弟は勉強はできないが、泳ぎにかけては誰にも負けない"
    ]
  },
  {
    "name": "にきまっている",
    "意味": "一定是...，表示对某事的确定或自信的推测，带有强烈的断定语气。",
    "tags": [
      "N2",
      "必然"
    ],
    "接续": "名词 + にきまっている / 动词普通形 + にきまっている",
    "说明": "用于表示根据现有情况或常识，推测某事一定会发生或某事的结果是确定的。通常用于表达说话者的自信或确信，具有很强的确定性。",
    "例句": [
      "あの人が犯人にきまっている。",
      "こんなに遅くまで働いたら、疲れきまっているに違いない。",
      "明日試合に勝つにきまっているよ。",
      "同じ値段なら、質がいい方がたくさん売れるに決まっている"
    ]
  },
  {
    "name": "に加えて",
    "意味": "除了...之外，还...，表示在某事物或动作的基础上，进一步加入其他的事物或动作。",
    "tags": [
      "N2",
      "顺接",
      "不仅"
    ],
    "接续": "名词 + に加えて / 动词辞书形 + に加えて",
    "说明": "用于表达除了某件事或某种状态外，还增加了其他事物或行动。通常用来列举多个事情或特征，表示相加、增加的意思。",
    "例句": [
      "彼は英語に加えて、フランス語も話せる。",
      "このプロジェクトには時間がかかるに加えて、予算も足りない。",
      "彼女は親切に加えて、非常に賢いです。",
      "原油の高騰に加えて、農産物も値上がりした"
    ]
  },
  {
    "name": "に応えて",
    "意味": "回应...，应...的要求或期望，表示某人或某事物为了回应某个请求、期望或情况而采取的行动。",
    "tags": [
      "N2",
      "其他"
    ],
    "接续": "名词 + に応えて",
    "说明": "用于表示对某人或某事物的期望、要求或反应作出回应，通常用于表达积极回应或做出某种行动以满足要求。常用于正式或书面语中。",
    "例句": [
      "彼はファンの期待に応えて、新しいアルバムを発表した。",
      "会社は社員の要求に応えて、労働条件を改善した。",
      "お客様のご要望に応えて、サービスを改良しました。"
    ]
  },
  {
    "name": "に際して",
    "意味": "在...时，表示某个特定时刻或场合下的行为或情况。",
    "tags": [
      "N2",
      "在"
    ],
    "接续": "名词 + に際して / 动词辞书形 + に際して",
    "说明": "用于表示在某个特定事件或情况发生时，通常带有正式、严肃的语气，强调在某个时刻或情况下需要注意的事情。多用于正式场合、通知或公告中。",
    "例句": [
      "新しいプロジェクトを開始するに際して、チーム全員に説明を行いました。",
      "旅行に際して、必要な書類を忘れないようにしてください。",
      "試験を受けるに際して、十分な準備が必要です。",
      "図書館のご利用に際しては、以下の点にご注意ください"
    ]
  },
  {
    "name": "に先立って",
    "意味": "在...之前，表示某件事发生之前，通常用于正式或书面语中，强调时间上的先后顺序。",
    "tags": [
      "N2",
      "顺序"
    ],
    "接续": "名词 + に先立って",
    "说明": "常用于正式场合或书面表达中，表示某个行为或事件发生之前，通常与计划、预备等相关，表示事件发生的先后顺序。",
    "例句": [
      "会議に先立って、資料を配布しました。",
      "イベントに先立って、参加者への案内が行われた。",
      "このプロジェクトの開始に先立って、準備会議を開きます。",
      "会議の開始に先立って、新しいメンバーが紹介された",
      "映画の一般公開に先立ち、プレミア試写会を行う予定だ"
    ]
  },
  {
    "name": "に従って",
    "意味": "按照...，根据...，表示按照某个规则、指示或标准做某事。",
    "tags": [
      "N2",
      "依据"
    ],
    "接续": "名词 + に従って / 动词辞书形 + に従って",
    "说明": "用于表示根据某个标准、规则、指导意见等去行动或做事。可以用在多种场景中，如指示、规定、计划等。通常用于说明行动或过程是基于某些标准或准则的。",
    "例句": [
      "このマニュアルに従って操作してください。",
      "会社の規則に従って行動することが求められています。",
      "年齢に従って、給料が上がるシステムです。",
      "会議での決定に従って、来月から新製品の生産を開始することになった"
    ]
  },
  {
    "name": "に従って",
    "意味": "根据...，按照...，表示根据某个规则、指示或情况做某事，或随着某个变化而变化。",
    "tags": [
      "N2",
      "伴随"
    ],
    "接续": "名词 + に従って / 动词辞书形 + に従って",
    "说明": "用来表示某个行为或变化是根据某个标准、指示、规则或情况发生的。常用于表达随某些条件的变化而发生的情况，或者某人或某物根据某个指示做事。",
    "例句": [
      "医学が進歩するに従って、平均寿命が延びた",
      "環境の変化に従って、新しい方法を取り入れました。",
      "年齢に従って、体力は衰えてきた。",
      "インターネットの普及に従って、情報共有かも進んでいる"
    ]
  },
  {
    "name": "にしたら・にすれば・にしても",
    "意味": "从...的角度来看，表示根据某人的立场、视角、条件等来推测或判断某种情况。",
    "tags": [
      "N2",
      "从～看"
    ],
    "接续": "名词 + にしたら / 名词 + にすれば / 名词 + にしても",
    "说明": "用于表达从某个角度、立场或条件出发，表示某种判断、建议或推测。可以用于个人观点、假设情况或客观条件。各形式有细微的差别：\n- 「にしたら」表示从某人的立场来看，常用于表达对某个情况的理解。\n- 「にすれば」表示从某人的选择或可能性来看，常用于建议或条件的表达。\n- 「にしても」表示即使从某个立场或角度来看，某种情况也不会改变，带有一种让步的意味。",
    "例句": [
      "学生にしたら、試験の前はとても緊張するだろう。",
      "彼女にすれば、この決定は理解できるだろう。",
      "どんなに努力しても、時間が足りないにしても、結果は変わらなかった。"
    ]
  },
  {
    "name": "にしては",
    "意味": "对于...来说，表示某种行为、状态、质量等与预期的标准或常识相反，通常带有不符合常规的感觉。",
    "tags": [
      "N2",
      "对比"
    ],
    "接续": "名词 + にしては / 动词普通形 + にしては / 形容词 + にしては",
    "说明": "用于表示与某个标准或预期不符的情况，通常用来评价某人的行为或某事物的性质，带有一定的惊讶或意外的语气。常用于对某件事或某人作出与预期不一致的评价。",
    "例句": [
      "初心者にしては、彼のプログラムは非常に上手だ。",
      "この値段にしては、品質がとてもいい。",
      "彼女は若いにしては、とても落ち着いている。",
      "初めてケーキを作ったにしては、上手にできましたね",
      "この子は小学生にしては、ずいぶんしっかりしている"
    ]
  },
  {
    "name": "にしろ・にせよ・にしても",
    "意味": "无论是...，即使是...，表示不管前面所述的情况如何，后面的结果或判断都成立。",
    "tags": [
      "N2",
      "不管不论"
    ],
    "接续": "名词 + にしろ / 动词普通形 + にしろ / 形容词 + にしろ / 名词 + にせよ / 动词普通形 + にせよ / 形容词 + にせよ / 名词 + にしても / 动词普通形 + にしても / 形容词 + にしても",
    "说明": "表示无论前面提到的是哪一种情况，后面所述的事情依然成立。用于强调一种无论如何都会发生的状态，具有一种选择或假设的语气。",
    "例句": [
      "彼が来るにしろ、来ないにしろ、会議は始まります。",
      "高いにしろ、安いにしろ、品質が大事だ。",
      "雨が降るにせよ、風が強いにせよ、今日は外で運動します。",
      "時間がないにしても、休憩を取るべきです。"
    ]
  },
  {
    "name": "に過ぎない",
    "意味": "仅仅是...，表示某事物或情况并不特别，只是简单的、有限的存在，带有轻微的否定意味。",
    "tags": [
      "N2",
      "其他"
    ],
    "接续": "名词 + に過ぎない / 动词普通形 + に過ぎない",
    "说明": "用来表示某事物或行为只是某种程度、范围或简单的状态，并不特别或重要，通常带有轻微的否定或贬低的意味。表示某个说法过于简单、没有深度或重要性。",
    "例句": [
      "これはただの趣味に過ぎない。",
      "彼の成功は運に過ぎない。",
      "私が言っていることは、意見に過ぎない。",
      "人間の脳に関する研究で、明らかになったことはまだほんの一部に過ぎないとは言え、その研究は着実に進んできた"
    ]
  },
  {
    "name": "に相違ない",
    "意味": "毫无疑问，一定是...，表示非常肯定某件事，认为某事是正确无误的。",
    "tags": [
      "N2",
      "必然"
    ],
    "接续": "名词 + に相違ない / 动词普通形 + に相違ない / 形容词 + に相違ない",
    "说明": "用于表达强烈的推测或判断，认为某事一定是某种情况。通常带有自信或强调某事不会错。适用于推断某事的真实性或准确性。",
    "例句": [
      "彼が犯人に相違ない。",
      "この問題の答えはこれに相違ない。",
      "彼女の態度から見ると、何かを隠しているに相違ない。",
      "服装はいつもとだいぶ違うが、やっぱりあれは田中さんに相違ない"
    ]
  },
  {
    "name": "に沿う",
    "意味": "按照...，遵循...，表示与某种标准、原则、计划或方向一致，符合某种要求或预期。",
    "tags": [
      "N2",
      "依据"
    ],
    "接续": "名词 + に沿う / 动词辞书形 + に沿う",
    "说明": "用于表示某个行动或方向符合某个标准、原则或要求，常用于描述按计划、规定、需求等执行。这个表达方式强调对规定或要求的遵循。",
    "例句": [
      "このプロジェクトは会社の方針に沿って進めています。",
      "私たちは法律に沿った手続きを行います。",
      "計画に沿うように進めてください。",
      "通りに沿って食べ物を売る店が並んでいる"
    ]
  },
  {
    "name": "に違いない",
    "意味": "一定是...，表示推测或确信某事是如此，强调某个事实或结论的确定性。",
    "tags": [
      "N2",
      "必然"
    ],
    "接续": "名词 + に違いない / 动词普通形 + に違いない / 形容词 + に違いない",
    "说明": "用于表示对某件事的确信或推测，通常基于某些线索或事实，强调自己对结论的信心。常用于表达自己推测的结果或对某种情况的确认。",
    "例句": [
      "彼は忙しいに違いない、いつも遅刻しているから。",
      "この料理は美味しいに違いない、匂いがとてもいいから。",
      "彼女があんなに泣いているのは、何か辛いことがあったに違いない。",
      "合計がこんなに大きい数字になるなんて、誰かが計算を間違えたに違いない"
    ]
  },
  {
    "name": "につき",
    "意味": "每...，表示以某个标准或单位为基础，通常用于定量或定额的情况，表示某种情况的数量、频率、时间等。",
    "tags": [
      "N2",
      "其他"
    ],
    "接续": "名词 + につき",
    "说明": "用来表示每一个单位、每一个数量或每一个时刻等，通常用于描述单价、收费、频率等。常见于正式场合，尤其是收费、定期活动或统计数据等。",
    "例句": [
      "この商品は100円につき、1ポイントが付きます。",
      "駐車場は1時間につき500円かかります。",
      "入場料は大人1000円、子供500円につきです。",
      "アルバイト料は昼は一時間につき八百円ですが、深夜は千円です"
    ]
  },
  {
    "name": "につき",
    "意味": "由于...，因为...，表示原因或理由，通常用于正式的场合或书面语中。",
    "tags": [
      "N2",
      "因果"
    ],
    "接续": "名词 + につき",
    "说明": "这个文法通常用于解释某个行为或情况的原因、理由。它常常出现在公告、通知或正式文书中，语气较为正式和客观，通常不用于日常口语。",
    "例句": [
      "天候不良につき、便が遅れます。",
      "本日は休業につき、営業しておりません。",
      "事故につき、通行止めとなっています。"
    ]
  },
  {
    "name": "につけ・につけても",
    "意味": "每当...，无论...，表示每当某个行为或状态发生时，总是伴随有某种结果或情况。",
    "tags": [
      "N2",
      "每当"
    ],
    "接续": "名词 + につけ / 动词连用形 + につけ",
    "说明": "表示每当某种情况发生时，都会有相同的结果或反应。可以用来描述一件事总是和另一件事一起发生，具有重复性和普遍性。'につけても'通常用于表示即使在某种情况下，前后的关系依然存在。",
    "例句": [
      "彼は仕事につけ、遊びにつけ、全力を尽くしている。",
      "この写真を見るにつけ、子供のことを思い出す"
    ]
  },
  {
    "name": "につけ・につけても",
    "意味": "无论...，不论...，表示对某种情况、行为、状态等无论如何都适用或无差别地处理。",
    "tags": [
      "N2",
      "不管不论"
    ],
    "接续": "名词 + につけ / 动词普通形 + につけ / 形容词 + につけ",
    "说明": "用于表示无论在什么情况下，某个行动或态度都会发生或维持。常用于强调某个行为或状态在不同的情况下都一样，带有重复或强调的语气。",
    "例句": [
      "喜ぶにつけ、悲しむにつけ、彼はいつも冷静だ。",
      "成功するにつけ、失敗するにつけ、彼は自分を見失わない。",
      "どんなことにつけても、慎重に考えることが大切だ。",
      "彼は嬉しいにつけて、悲しいにつけ、よくお酒を飲む"
    ]
  },
  {
    "name": "に伴って",
    "意味": "随着...，表示随着某种变化、情况或条件的发生，另一件事情也会发生或变化。",
    "tags": [
      "N2",
      "伴随"
    ],
    "接续": "名词 + に伴って / 动词辞书形 + に伴って",
    "说明": "用于表示某个变化、发展或情况的发生，导致另一件事情的变化或产生相应的影响。常用于描述因果关系或一事接着一事的情况。",
    "例句": [
      "経済の成長に伴って、生活水準も向上した。",
      "新しい技術の導入に伴って、仕事の内容も変わった。",
      "社会の変化に伴って、教育方法も進化している。",
      "この島は、森林の減少に伴って、島や動物の数が減ってきている"
    ]
  },
  {
    "name": "に反して",
    "意味": "与...相反，表示某事与预期或某个规则、原则、情况相违背或相对立。",
    "tags": [
      "N2",
      "对比"
    ],
    "接续": "名词 + に反して / 动词普通形 + に反して",
    "说明": "用于表示与某个标准、预期或规则相反的情况，强调的是与预期或规定的背离，常用于描述违反常规或对立的情境。",
    "例句": [
      "彼の行動は予想に反して、成功を収めた。",
      "今朝の天気予報では、午後から晴れるといっていた、ところが、予報に反して、雨が降る続いている",
      "規則に反して、彼は仕事を早退した。"
    ]
  },
  {
    "name": "にほかならない",
    "意味": "正是...，表示对某事的强调，指某个事物或行为没有其他可能性，只有某种原因或理由。",
    "tags": [
      "N2",
      "强调",
      "因果"
    ],
    "接续": "名词 + にほかならない",
    "说明": "这个文法用来强调某事的唯一性，表示某种情况的本质或原因，强调它不可能是其他的。常用于阐明原因、理由或强调某事的必然性。",
    "例句": [
      "彼が成功した理由は、努力にほかならない。",
      "この決定は上司の意向にほかならない。",
      "この問題は予算不足にほかならない。",
      "今回の失敗の原因は、準備不足に他ならない"
    ]
  },
  {
    "name": "にもかかわらず",
    "意味": "尽管...，表示对比、逆接，说明某个事实或情况与预期不符，强调虽然存在某种障碍或条件，某事仍然发生或成立。",
    "tags": [
      "N2",
      "逆接",
      "虽然～但是"
    ],
    "接续": "名词 + にもかかわらず / 动词普通形 + にもかかわらず / 形容词 + にもかかわらず",
    "说明": "用于表示尽管有某种困难或条件，某个结果依然发生，通常带有一种逆接的含义。强调不受某个障碍或情况的影响。",
    "例句": [
      "彼は忙しいにもかかわらず、手伝ってくれた。",
      "天気が悪いにもかかわらず、多くの人がイベントに参加した。",
      "高い値段にもかかわらず、その商品はすぐに売り切れた。",
      "彼は、夏休み中にもかかわらず、毎日図書館で勉強している"
    ]
  },
  {
    "name": "に基づいて",
    "意味": "根据...，基于...，表示根据某个依据或根据某种标准进行行动或判断。",
    "tags": [
      "N2",
      "依据"
    ],
    "接续": "名词 + に基づいて / 动词辞书形 + に基づいて",
    "说明": "用于表示某个行动、决策或事情的基础是某种依据或标准，常用于描述依照某些规则、原则或事实做出的行为或决策。它通常与规则、法律、数据等相关联。",
    "例句": [
      "この計画は最新のデータに基づいて立てられました。",
      "彼の意見は調査結果に基づいています。",
      "この判断は法律に基づいて行われました。"
    ]
  },
  {
    "name": "にわたる",
    "意味": "涉及到...，表示范围、领域或时间跨度，强调某事物或某种影响的广泛性。",
    "tags": [
      "N2",
      "范围"
    ],
    "接续": "名词 + にわたる",
    "说明": "用来表示某个动作、影响、时间、范围等跨越很大的范围，通常用于强调某种广泛的涉及或连续的程度。常用来描述覆盖的范围或持续的时间。",
    "例句": [
      "この研究は10年にわたるものだ。",
      "その問題は国際的にわたる影響を及ぼす可能性がある。",
      "彼の活躍は世界中にわたる。",
      "踏切事故のために、二時間にわたり、電車がストップしました",
      "公園の整備を求める住民と役所の話し合いは、10年長期に渡った",
      "ここから二百メートルに渡って、桜の並木が続いている"
    ]
  },
  {
    "name": "抜きで・抜きに・を抜きにして",
    "意味": "去除...，表示排除某事物或情况，强调不考虑某个因素或去掉某个条件。",
    "tags": [
      "N2",
      "其他"
    ],
    "接续": "名词 + 抜きで / 名词 + 抜きに / 名词 + を抜きにして",
    "说明": "用于表示去除某个条件、因素或情况，常用于强调排除某些不重要或不需要的部分。可以用在实际行动或情况描述中，表达不考虑某个因素。",
    "例句": [
      "今回はお金抜きで話を進めましょう。",
      "彼は意見を抜きにして、この計画を進めた。",
      "その問題を抜きにして、会話を続けましょう。",
      "冗談抜きで真面目に考えてください",
      "硬い挨拶は抜きにして、早速乾杯しましょう"
    ]
  },
  {
    "name": "抜きでは・抜きには・を抜きにしては",
    "意味": "如果没有...，表示去除某个条件或因素后，某事就无法发生或某个结果就无法成立。",
    "tags": [
      "N2",
      "条件"
    ],
    "接续": "名词 + 抜きでは / 名词 + 抜きには / 名词 + を抜きにしては",
    "说明": "用于表达在去除某个条件或因素后，某种行为或结果无法实现，带有强烈的否定意味。强调去掉某个必要部分后事情无法继续进行。",
    "例句": [
      "彼の協力抜きでは、このプロジェクトは成功しない。",
      "努力抜きには、目標を達成することはできない。",
      "計画を抜きにしては、何も進まない。",
      "この論文は先生の指導抜きには完成できない"
    ]
  },
  {
    "name": "抜く",
    "意味": "完成某项任务，表示做完、做到最后或尽力做某事。",
    "tags": [
      "N2",
      "其他"
    ],
    "接续": "动词ます形 + 抜く",
    "说明": "通常用于表示做某事时付出了努力，或者做完了某个动作或任务。它强调最终的结果，往往有“彻底完成”或“坚持到底”的含义。",
    "例句": [
      "あの人もずいぶん悩み抜いて、会社を辞めることを決めたんでしょう"
    ]
  },
  {
    "name": "のみならず",
    "意味": "不仅...而且...，表示不仅有前述的内容，还包括其他的事物或情况。",
    "tags": [
      "N2",
      "不仅"
    ],
    "接续": "名词 + のみならず / 动词普通形 + のみならず / 形容词 + のみならず",
    "说明": "用于连接两个相似或相关的内容，表示不仅有前面的内容，还包括其他内容。通常用于书面语，语气较正式。",
    "例句": [
      "彼は日本語のみならず、英語も上手だ。",
      "この店は値段が安いのみならず、品質も良い。",
      "あの映画はストーリーのみならず、映像も素晴らしい。"
    ]
  },
  {
    "name": "のもとで・のもとに",
    "意味": "在...的指引或影响下，表示在某种条件、环境或领导下进行的行为或状态。",
    "tags": [
      "N2",
      "在"
    ],
    "接续": "名词 + のもとで / 名词 + のもとに",
    "说明": "这个表达常用于表示在某种条件、环境或人的影响下做某事。'のもとで' 通常强调在某种环境或指导下，'のもとに' 强调在某个前提或指引下，二者的区别较为细微。",
    "例句": [
      "彼は厳しい指導者のもとで成長した。",
      "その計画は専門家のもとに進められている。",
      "このプロジェクトは多くの支援のもとに実施された。"
    ]
  },
  {
    "name": "ばかりか",
    "意味": "不仅...而且，还...，表示在某事物之外，另有其他更为突出的情况。",
    "tags": [
      "N2",
      "不仅",
      "ばかり"
    ],
    "接续": "名词 + ばかりか / 动词普通形 + ばかりか / 形容词 + ばかりか",
    "说明": "用于强调不仅仅是某种情况，还涉及其他更多的内容，表示事物范围的扩大，通常与另一个更强烈的情况连用。",
    "例句": [
      "彼は英語ばかりか、フランス語も話せる。",
      "この映画は面白いばかりか、感動的でもあった。",
      "彼女は忙しいばかりか、体調も悪いらしい。"
    ]
  },
  {
    "name": "ばかりに",
    "意味": "正因为...，结果却是...，表示某种原因导致了不好的结果，强调因果关系。",
    "tags": [
      "N2",
      "因果",
      "ばかり"
    ],
    "接续": "动词普通形 + ばかりに / 名词 + ばかりに",
    "说明": "用于强调某个具体原因导致了不理想或不幸的结果，通常带有负面的含义，表示因小失大的情况。",
    "例句": [
      "彼の嘘を信じたばかりに、失敗してしまった。",
      "大きな声で話したばかりに、周りの人が驚いてしまった。",
      "試験勉強をサボったばかりに、合格できなかった。"
    ]
  },
  {
    "name": "はともかく",
    "意味": "某事物不管怎样，先不提，重点在于其他事物。表示把某个话题或问题暂时放在一边，转而讨论其他更重要或更紧迫的事情。",
    "tags": [
      "N2",
      "其他"
    ],
    "接续": "名词 + はともかく / 动词普通形 + はともかく / 形容词 + はともかく",
    "说明": "用于在讨论中将某个事物暂时忽略或不予考虑，而将注意力集中在其他更重要的事物上。语气上有时带有轻描淡写的感觉，表示某事不重要或不值得讨论。",
    "例句": [
      "その問題はともかく、まずは他のことを考えよう。",
      "彼の態度はともかく、結果が重要だ。",
      "値段はともかく、この製品の品質が素晴らしい。",
      "このレストランは、味はともかく、量は多い"
    ]
  },
  {
    "name": "は別として",
    "意味": "暂且不提...，用来表示将某事物从当前话题中排除，通常是为了强调其他更重要或相关的事物。",
    "tags": [
      "N2",
      "其他"
    ],
    "接续": "名词 + は別として / 动词基本形 + は別として",
    "说明": "用于将某个对象或话题从讨论中排除，强调其它事项。常用于表达不考虑某些细节或事情，专注于其他更重要的内容。",
    "例句": [
      "彼の意見は別として、私は自分の考えを言いたい。",
      "お金のことは別として、彼女の考え方は素晴らしい。",
      "試験の結果は別として、彼の努力は認められるべきだ。"
    ]
  },
  {
    "name": "はもちろん",
    "意味": "不仅仅是...，而且...，表示某个情况或事物本身已经是理所当然或显而易见的，同时还包括其他相关的、更重要的事情。",
    "tags": [
      "N2",
      "不仅"
    ],
    "接续": "名词 + はもちろん / 动词基本形 + はもちろん",
    "说明": "用于列举出已经显而易见或理所当然的事情，表示除了这个情况之外，还包括其他更重要或更显著的事情。",
    "例句": [
      "彼は日本語はもちろん、英語も話せる。",
      "この映画は内容はもちろん、映像も素晴らしかった。",
      "あのレストランは味はもちろん、サービスも抜群だ。"
    ]
  },
  {
    "name": "はもとより",
    "意味": "不仅仅是...，连...都，表示某个情况或事物本来就是理所当然的，甚至包括了其他更为极端或显而易见的事情。",
    "tags": [
      "N2",
      "不仅"
    ],
    "接续": "名词 + はもとより / 动词基本形 + はもとより",
    "说明": "用于强调某个事情本身就已经是理所当然的，甚至包含了更极端或更大的范围，表达更强烈的列举或强调意义。",
    "例句": [
      "彼の実力は日本国内はもとより、海外でも認められている。",
      "この問題は学生だけはもとより、先生も悩んでいる。",
      "この公園は週末には人が多いが、平日はもとより、夜も静かだ。"
    ]
  },
  {
    "name": "ほかない・より他ない・他仕方がない",
    "意味": "没有其他选择，只能...，表示某种情况无法避免，必须做某事，通常用于表达无奈或只能接受的现实。",
    "tags": [
      "N2",
      "必然"
    ],
    "接续": "名词 + ほかない / 动词原形 + ほかない / 名词 + より他ない / 动词原形 + より他ない / 名词 + 他仕方がない / 动词原形 + 他仕方がない",
    "说明": "这三种表达都表示在某种情况下没有其他选择，只能采取某种行为或方式。区别在于：\n- 'ほかない' 更口语化，适用于日常对话。\n- 'より他ない' 更正式，常用于书面语或较正式的场合。\n- '他仕方がない' 语气最正式，并带有认命或无奈的情感色彩。",
    "例句": [
      "この問題は解決するためには、彼に頼むほかない。",
      "時間がないので、急いで行くほかない。",
      "こんな状況では、あきらめるより他ない。",
      "できることはそれしかないので、その方法より他ない。",
      "彼を信じるより他ない。",
      "この問題はもう解決する方法がない、他仕方がない。",
      "彼が遅れるなら、待つ他仕方がない。",
      "天気が悪いから、今日は外出できない、他仕方がない。"
    ]
  },
  {
    "name": "まい",
    "意味": "表示不打算做某事或推测某事不会发生。通常用于表示强烈的决心、意图或否定的推测。",
    "tags": [
      "N2",
      "否定"
    ],
    "接续": "动词基本形 + まい / 动词ない形 + まい",
    "说明": "表示决心不做某事，或者推测某件事不会发生。与「ないだろう」类似，但语气更为强烈或固执。常用于表示坚决否定某事。",
    "例句": [
      "もう二度とあんなことをしまい。",
      "彼はあんなに頑張っているから、失敗するまい。",
      "私はそのようなことを言うまいと思っている。"
    ]
  },
  {
    "name": "もかまわず",
    "意味": "不顾，不在乎，表示对某事物或情况不加考虑，做某事时不理会其他的事情。",
    "tags": [
      "N2",
      "其他"
    ],
    "接续": "名词 + も構わず / 动词て形 + も構わず",
    "说明": "表示做某件事情时，对可能产生的后果、阻碍或反对不加理会，通常带有强烈的决心或不顾一切的态度。常用于强调某人不顾及或不在乎周围的状况。",
    "例句": [
      "彼は周りの反対も構わず、自分の道を進んだ。",
      "雨が降っているのも構わず、彼は外で遊んでいる。",
      "親の意見も構わず、私は自分の選んだ仕事をするつもりだ。"
    ]
  },
  {
    "name": "ものか",
    "意味": "表示强烈的否定，意为“绝不会...”，“怎么可能...”，用来表达说话人的强烈反对或不相信某事。",
    "tags": [
      "N2",
      "否定"
    ],
    "接续": "动词意志形 + ものか / 形容词 + ものか",
    "说明": "用于否定某种推测、假设或观点，带有强烈的情感色彩，表示说话人强烈的不赞同或不相信某件事。常用于口语中，语气较为强烈。",
    "例句": [
      "そんなことをするものか。",
      "あんなに難しい問題、解けるものか。",
      "彼がそんなことを言うものか、信じられない。"
    ]
  },
  {
    "name": "ものがある",
    "意味": "某种情感、倾向、特征、情况等存在，通常表示某种事物或行为带有某种特点或情感，常用于表达主观看法或感受。",
    "tags": [
      "N2",
      "其他"
    ],
    "接续": "动词普通形 + ものがある / 形容词 + ものがある / 名词 + ものがある",
    "说明": "用于表示某种情感、想法或特征的存在，通常带有主观看法，表示对某事的评价或感觉。也可以用来表示某种事物的特征或存在的理由。常见于表达感叹或对某事物的感受。",
    "例句": [
      "彼の言い方には少し不満があるものがある。",
      "この映画には心に残るものがある。",
      "彼の態度には納得できないものがある。",
      "こんな単純な作業を三時間も続けるのは、辛いものがある"
    ]
  },
  {
    "name": "ものだから",
    "意味": "由于...，因为...，通常用于解释某种原因或背景，表示某个行为或现象是因为某种原因，常带有一些主观情感或理解。",
    "tags": [
      "N2",
      "因果"
    ],
    "接续": "动词普通形 + ものだから / 形容词 + ものだから / 名词 + ものだから",
    "说明": "だって,常用于说明事情的原因或理由，通常带有一些情感色彩，解释自己的行为或态度。这个表达有时含有自我辩解的语气。",
    "例句": [
      "遅刻したものだから、上司に叱られてしまった。",
      "今日は忙しいものだから、明日の会議には出られません。",
      "あの人が好きなものだから、どうしても応援したくなります。"
    ]
  },
  {
    "name": "ものではない",
    "意味": "某种行为或情况是不应该的，表示否定某种行为或观点，通常带有规劝或强调不应该做某事的意味。",
    "tags": [
      "N2",
      "否定"
    ],
    "接续": "动词基本形 + ものではない / 名词 + である + ものではない",
    "说明": "用于表示某种行为或说法是不合适或不应该的，常用于提醒、警告或表明某个行为是不正确的。也可用于给出建议或批评。",
    "例句": [
      "人をいじめるのは許されるものではない。",
      "あんなことを言うものではない。",
      "勝手に他人の物を取るものではない。"
    ]
  },
  {
    "name": "ものなら",
    "意味": "如果能够做到...，表示对某种理想或假设情况的愿望、尝试或条件，带有假设的语气，常带有不太可能实现的意思。",
    "tags": [
      "N2",
      "如果"
    ],
    "接续": "动词可能形 + ものなら",
    "说明": "用于表示如果某件事情能够实现或者可能发生，接下来会有什么结果，常用于表达假设、愿望或对不可能实现的事情的设想。此语法通常带有一些不太可能实现的意味。",
    "例句": [
      "もし時間があるものなら、旅行に行きたい。",
      "彼が助けてくれるものなら、何でも頼みたい。",
      "できるものなら、あの仕事を辞めたい。"
    ]
  },
  {
    "name": "ものの",
    "意味": "虽然...，但是...，表示某事虽然是如此，但后面接的是与预期或常理相反的内容。",
    "tags": [
      "N2",
      "逆接",
      "虽然～但是"
    ],
    "接续": "动词普通形 + ものの / 形容词 + ものの / 名词 + である + ものの",
    "说明": "表示某个事物或情况尽管是某种状态，但实际上后续有与之相反或出乎意料的情况。常用于描述虽然如此，但实际情况与预期有所不同。",
    "例句": [
      "彼は日本語が上手なものの、会話はまだ少し苦手だ。",
      "天気予報では晴れると言っていたものの、雨が降り始めた。",
      "試験の準備をしたものの、結果は思うようにいかなかった。"
    ]
  },
  {
    "name": "ようでは",
    "意味": "如果...的话，表示某种情况或结果的消极推测，通常用于警告或提醒，带有否定或不好的含义。",
    "tags": [
      "N2",
      "如果"
    ],
    "接续": "动词意向形 + ようでは",
    "说明": "用于表示假设某种行为或情况发生，结果可能会非常糟糕，带有警示、提醒或警告的意味。通常用来指出某种行为不合适或不理想，可能导致不好的后果。",
    "例句": [
      "こんなことをしているようでは、成功は難しいだろう。",
      "遅刻が多いようでは、信頼されなくなる。",
      "準備が足りないようでは、試験に合格できない。"
    ]
  },
  {
    "name": "ようなら・ようだったら",
    "意味": "如果...的话，表示假设条件，通常用于某种情况发生时的假设，含有推测和条件的意味。",
    "tags": [
      "N2",
      "如果"
    ],
    "接续": "动词辞书形 + ようなら / 形容词辞书形 + ようなら / 名词 + のようなら / 动词过去形 + ようだったら / 形容词过去形 + ようだったら / 名词 + のようだったら",
    "说明": "用于表示某种假设条件，前提是如果某个情况成立或某个条件发生时，后续的行为或结果才会发生。'ようなら'多用于现在或将来的假设，'ようだったら'用于过去的假设或假设的条件。",
    "例句": [
      "天気が良いようなら、ピクニックに行こう。",
      "あなたが行くようなら、私も行くつもりだ。",
      "もしその問題が解決できるようだったら、報告してください。",
      "昔のようだったら、彼に頼んでもいいと思う。"
    ]
  },
  {
    "name": "わりに",
    "意味": "与预期相比，表示某事物出乎意料地比想象中更好或更差，通常用于对比。",
    "tags": [
      "N2",
      "对比"
    ],
    "接续": "名词 + わりに / 动词基本形 + わりに / 形容词 + わりに",
    "说明": "用来表示对某个事物的评价或感受，强调与预期的对比，表示出乎意料的结果或特点。常用于对比正反两方面的情况。",
    "例句": [
      "彼は年齢のわりに若く見える。",
      "この店は値段のわりに料理が美味しい。",
      "彼女は初心者のわりに上手にピアノを弾く。",
      "このレストランは高い割には、うまいとは言えない"
    ]
  },
  {
    "name": "をかねて",
    "意味": "兼顾，表示做某事的同时，顺便做另一件事，通常指主次并行。",
    "tags": [
      "N2",
      "其他"
    ],
    "接续": "名词 + をかねて",
    "说明": "表示做某个主要的动作或任务时，同时进行另一个相关的活动。通常用于表示一种额外的目的或动机，强调不单纯为了某一件事，而是同时有多个目的。",
    "例句": [
      "旅行をかねて、友達に会いに行った。",
      "健康管理をかねて、毎朝ジョギングをしている。",
      "買い物をかねて、近くの公園で散歩した。"
    ]
  },
  {
    "name": "を問わず",
    "意味": "不论…，表示不受某一条件或限制的影响，强调无论情况如何都适用。",
    "tags": ["N2", "不管不论"],
    "接续": "名词 + を問わず / 动词辞书形 + を問わず",
    "说明": "用来表示不受某种条件、范围、情况等限制，适用于各种情况。通常用于表示某一行为或事物在不同情况下都能发生或成立。",
    "例句": [
      "年齢を問わず、誰でも参加できます。",
      "天候を問わず、イベントは開催されます。",
      "経験の有無を問わず、全員が挑戦できます。"
    ]
  },
  {
    "name": "を除いて",
    "意味": "除了...之外，表示排除某个部分或对象，指明不包括某一项。",
    "tags": ["N2", "其他"],
    "接续": "名词 + を除いて",
    "说明": "用于表达除某个事物或人之外，其他的事物或人都包含在内。通常用于列举时，指出例外或排除的部分。",
    "例句": [
      "このイベントは学生を除いて誰でも参加できます。",
      "彼は日本人を除いて、全員が参加します。",
      "試験の範囲は教科書を除いて、ノートに書いてあることです。"
    ]
  },
  {
    "name": "をもとに",
    "意味": "以...为基础、根据...，表示某事物或行动是建立在某些事实、数据、经验或理论的基础上。",
    "tags": ["N2", "依据"],
    "接续": "名词 + をもとに",
    "说明": "用于表示某个行动、判断或决策是基于某些资料、经验或前提。常用来表示某个具体的基础或依据。可以表示从现有的事物或信息中出发，做出某种行为或决策。",
    "例句": [
      "この研究は最新のデータをもとに行われた。",
      "彼の意見は実際の経験をもとにしている。",
      "この映画は実際の事件をもとにして作られた。"
    ]
  },
  {
    "name": "あ・ご〜願えませんか",
    "意味": "用来表示礼貌地请求对方的某种帮助或行动，带有尊敬和客气的语气。",
    "tags": ["N2", "敬语"],
    "接续": "动词连用形（ます形去掉ます）+ 願えませんか",
    "说明": "是一种较为正式且礼貌的表达方式，常用于请求他人做某事，适用于商业场合或正式交流中。通过使用尊敬语“ご〜”或“お〜”进一步提升礼貌程度。",
    "例句": [
      "少々お待ち願えませんか。",
      "ご協力願えませんか。",
      "この書類をご確認願えませんか。"
    ]
  },
  {
    "name": "お・ご〜申し上げる",
    "意味": "表示自谦，表达对他人行为的敬意，同时强调自己的行为是为了对方而进行的，常用于正式或礼貌场合。",
    "tags": ["N2", "敬语"],
    "接续": "お + 动词连用形（ます形去掉ます） + 申し上げる / ご + サ变动词词干 + 申し上げる",
    "说明": "属于自谦表达，用于对自己行为的降低来提高对方的地位，适用于正式场合。常见于书信、商业邮件、正式演讲等场合。该表达形式不能用于直接描述对方的行为。",
    "例句": [
      "お礼を申し上げます。",
      "この場をお借りして、一言ご挨拶を申し上げます。",
      "心よりお詫び申し上げます。"
    ]
  },
  {
    "name": "させていただけませんか",
    "意味": "请求对方允许自己做某事的非常礼貌的表达方式，带有尊敬和谦逊的语气。",
    "tags": ["N2", "敬语"],
    "接续": "动词使役形（させる形）+ ていただけませんか",
    "说明": "用于表达请求自己的行为能否被允许，体现对对方的尊重。常用于正式场合或需要特别礼貌的场景下，带有谦逊和请求的意味。",
    "例句": [
      "このプロジェクトについて、説明させていただけませんか。",
      "少し時間を取らせていただけませんか。",
      "資料を確認させていただけませんか。"
    ]
  },
  {
    "name": "させてやっていただけませんか",
    "意味": "礼貌地请求对方允许某人（通常是自己相关的人）去做某事，表达极为谦逊和客气的语气。",
    "tags": ["N2","敬语"],
    "接续": "动词使役形 + させてやっていただけませんか",
    "说明": "通常用于请求对方对自己相关的人（如下属、孩子等）给予某种许可或恩惠，强调对方的好意，同时展现自己的谦逊态度。适合正式或较为郑重的场合。",
    "例句": [
      "息子にこの機会を経験させてやっていただけませんか。",
      "新人にこの仕事をやらせてやっていただけませんか。",
      "部下に直接説明させてやっていただけませんか。"
    ]
  },
  {
    "name": "ていただけるとありがたいんですが",
    "意味": "表示如果对方能为自己做某事会非常感激，用于委婉而礼貌地请求他人帮助。",
    "tags": ["N2", "敬语"],
    "接续": "动词て形 + いただけるとありがたいんですが",
    "说明": "是一种非常礼貌和委婉的请求表达方式，通常用于职场或正式场合，传达对请求的期待和感激之情。语气柔和，适合希望对方采纳但又不想造成压力的场合。",
    "例句": [
      "もう少し早めにご連絡いただけるとありがたいんですが。",
      "この件について説明していただけるとありがたいんですが。",
      "その資料をコピーしていただけるとありがたいんですが。"
    ]
  }
]



























